[Killed] BlockStatement
src/core/practice/waitmode.ts:111:75
 const IDLE: WaitState = { waiting: false, requiredNotes: NO_NOTES, satisfiedNotes: NO_PITCHES }
 
 /** First index whose `startTick` is >= `tick`; the score is sorted by onset. */
-function firstNoteFrom(notes: readonly ScoreNote[], tick: number): number {
-  let lo = 0
-  let hi = notes.length
-  while (lo < hi) {
-    const mid = (lo + hi) >>> 1
-    if (at(notes, mid).startTick < tick) lo = mid + 1
-    else hi = mid
-  }
-  return lo
-}
+function firstNoteFrom(notes: readonly ScoreNote[], tick: number): number {}
 
 export class WaitModeController {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:114:10
 function firstNoteFrom(notes: readonly ScoreNote[], tick: number): number {
   let lo = 0
   let hi = notes.length
-  while (lo < hi) {
+  while (false) {
     const mid = (lo + hi) >>> 1
     if (at(notes, mid).startTick < tick) lo = mid + 1
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] EqualityOperator
src/core/practice/waitmode.ts:114:10
 function firstNoteFrom(notes: readonly ScoreNote[], tick: number): number {
   let lo = 0
   let hi = notes.length
-  while (lo < hi) {
+  while (lo >= hi) {
     const mid = (lo + hi) >>> 1
     if (at(notes, mid).startTick < tick) lo = mid + 1
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] ArithmeticOperator
src/core/practice/waitmode.ts:115:18
   let lo = 0
   let hi = notes.length
   while (lo < hi) {
-    const mid = (lo + hi) >>> 1
+    const mid = (lo - hi) >>> 1
     if (at(notes, mid).startTick < tick) lo = mid + 1
     else hi = mid
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: index 2147483635 out of bounds (length 25)

[Killed] EqualityOperator
src/core/practice/waitmode.ts:116:9
   let hi = notes.length
   while (lo < hi) {
     const mid = (lo + hi) >>> 1
-    if (at(notes, mid).startTick < tick) lo = mid + 1
+    if (at(notes, mid).startTick <= tick) lo = mid + 1
     else hi = mid
   }
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:116:9
   let hi = notes.length
   while (lo < hi) {
     const mid = (lo + hi) >>> 1
-    if (at(notes, mid).startTick < tick) lo = mid + 1
+    if (at(notes, mid).startTick >= tick) lo = mid + 1
     else hi = mid
   }
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Survived] BooleanLiteral
src/core/practice/waitmode.ts:135:21
   private satisfied: Midi[] = []
   /** Keys physically down, so a held-over key cannot be re-credited. */
   private readonly down = new Set<Midi>()
-  private holding = false
+  private holding = true
   /** Onset the barrier is armed on; `null` when it is unarmed or holds a fence. */
   private armedOnset: number | null = null

[Killed] BlockStatement
src/core/practice/waitmode.ts:147:84
   private snapshot: WaitState = IDLE
 
   /** `score` must be the score the transport is playing — the wait is armed from it. */
-  constructor(transport: Transport, score: Score, settings: WaitModeSettings = {}) {
-    this.transport = transport
-    this.score = score
-    this.requireAll = settings.requireAllChordNotes ?? WAIT_MODE_DEFAULTS.requireAllChordNotes
-    this.allowExtra = settings.allowExtraNotes ?? WAIT_MODE_DEFAULTS.allowExtraNotes
-    const hands = settings.hands
-    if (hands === undefined) {
-      this.hands = null
-    } else {
-      for (const hand of hands) invariant(HANDS.includes(hand), `unknown hand: ${hand}`)
-      this.hands = [...hands]
-    }
-  }
+  constructor(transport: Transport, score: Score, settings: WaitModeSettings = {}) {}
 
   // ------------------------------------------------------------------ queries
killedBy: WaitModeController construction pumping a stopped transport stays idle and emits nothing
statusReason: Cannot read properties of undefined (reading 'cursorGeneration')

[Killed] LogicalOperator
src/core/practice/waitmode.ts:150:23
   constructor(transport: Transport, score: Score, settings: WaitModeSettings = {}) {
     this.transport = transport
     this.score = score
-    this.requireAll = settings.requireAllChordNotes ?? WAIT_MODE_DEFAULTS.requireAllChordNotes
+    this.requireAll = settings.requireAllChordNotes && WAIT_MODE_DEFAULTS.requireAllChordNotes
     this.allowExtra = settings.allowExtraNotes ?? WAIT_MODE_DEFAULTS.allowExtraNotes
     const hands = settings.hands
killedBy: chords holds until every note of the triad is down
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/core/practice/waitmode.ts:151:23
     this.transport = transport
     this.score = score
     this.requireAll = settings.requireAllChordNotes ?? WAIT_MODE_DEFAULTS.requireAllChordNotes
-    this.allowExtra = settings.allowExtraNotes ?? WAIT_MODE_DEFAULTS.allowExtraNotes
+    this.allowExtra = settings.allowExtraNotes && WAIT_MODE_DEFAULTS.allowExtraNotes
     const hands = settings.hands
     if (hands === undefined) {

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:153:9
     this.requireAll = settings.requireAllChordNotes ?? WAIT_MODE_DEFAULTS.requireAllChordNotes
     this.allowExtra = settings.allowExtraNotes ?? WAIT_MODE_DEFAULTS.allowExtraNotes
     const hands = settings.hands
-    if (hands === undefined) {
+    if (false) {
       this.hands = null
     } else {
killedBy: WaitModeController construction starts idle
statusReason: hands is not iterable

[Killed] EqualityOperator
src/core/practice/waitmode.ts:153:9
     this.requireAll = settings.requireAllChordNotes ?? WAIT_MODE_DEFAULTS.requireAllChordNotes
     this.allowExtra = settings.allowExtraNotes ?? WAIT_MODE_DEFAULTS.allowExtraNotes
     const hands = settings.hands
-    if (hands === undefined) {
+    if (hands !== undefined) {
       this.hands = null
     } else {
killedBy: WaitModeController construction starts idle
statusReason: hands is not iterable

[Killed] BlockStatement
src/core/practice/waitmode.ts:155:12
     const hands = settings.hands
     if (hands === undefined) {
       this.hands = null
-    } else {
-      for (const hand of hands) invariant(HANDS.includes(hand), `unknown hand: ${hand}`)
-      this.hands = [...hands]
-    }
+    } else {}
   }
 
killedBy: WaitModeController construction rejects a hand that is not a hand
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/core/practice/waitmode.ts:156:65
     if (hands === undefined) {
       this.hands = null
     } else {
-      for (const hand of hands) invariant(HANDS.includes(hand), `unknown hand: ${hand}`)
+      for (const hand of hands) invariant(HANDS.includes(hand), ``)
       this.hands = [...hands]
     }

[Killed] BlockStatement
src/core/practice/waitmode.ts:163:26
 
   // ------------------------------------------------------------------ queries
 
-  get state(): WaitState {
-    // `waiting` is derived from the transport, which the caller can pause, stop or
-    // seek behind this controller's back, so the cached snapshot is refreshed here
-    // rather than only at the points where this controller changes something.
-    if (this.snapshot.waiting !== this.isWaiting()) this.publish()
-    return this.snapshot
-  }
+  get state(): WaitState {}
 
   // -------------------------------------------------------------------- input
killedBy: WaitModeController construction starts idle
statusReason: expected undefined to deeply equal { waiting: false, …(2) }

[Killed] EqualityOperator
src/core/practice/waitmode.ts:167:9
     // `waiting` is derived from the transport, which the caller can pause, stop or
     // seek behind this controller's back, so the cached snapshot is refreshed here
     // rather than only at the points where this controller changes something.
-    if (this.snapshot.waiting !== this.isWaiting()) this.publish()
+    if (this.snapshot.waiting === this.isWaiting()) this.publish()
     return this.snapshot
   }
killedBy: pause, seek, stop and tempo during a wait a pause during a wait is not a wait
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:167:9
     // `waiting` is derived from the transport, which the caller can pause, stop or
     // seek behind this controller's back, so the cached snapshot is refreshed here
     // rather than only at the points where this controller changes something.
-    if (this.snapshot.waiting !== this.isWaiting()) this.publish()
+    if (false) this.publish()
     return this.snapshot
   }
killedBy: pause, seek, stop and tempo during a wait a pause during a wait is not a wait
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/practice/waitmode.ts:178:28
    * if the pump parked on that onset. Returns the transport's events for this
    * frame plus the wait state they left behind.
    */
-  update(): WaitModeUpdate {
-    this.noticeMovedPlayhead()
-    if (!this.holding && this.transport.state !== 'stopped') this.armBarrier()
-    const events = this.transport.tick()
-    this.armFromPark(events)
-    // `stop()` and the end of the piece both drop the gate on the transport side.
-    if (this.transport.state === 'stopped') {
-      this.consumedOnset = null
-      this.disarm()
-    }
-    this.lastPosition = this.transport.positionTicks
-    this.lastCursor = this.transport.cursorGeneration
-    return { events, wait: this.state }
-  }
+  update(): WaitModeUpdate {}
 
   /** One MIDI note-on. Credits the armed requirement and resumes when it is met. */
killedBy: WaitModeController construction pumping a stopped transport stays idle and emits nothing
statusReason: Cannot read properties of undefined (reading 'events')

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:180:9
    */
   update(): WaitModeUpdate {
     this.noticeMovedPlayhead()
-    if (!this.holding && this.transport.state !== 'stopped') this.armBarrier()
+    if (true) this.armBarrier()
     const events = this.transport.tick()
     this.armFromPark(events)
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/practice/waitmode.ts:180:26
    */
   update(): WaitModeUpdate {
     this.noticeMovedPlayhead()
-    if (!this.holding && this.transport.state !== 'stopped') this.armBarrier()
+    if (!this.holding && this.transport.state === 'stopped') this.armBarrier()
     const events = this.transport.tick()
     this.armFromPark(events)
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:184:45
     const events = this.transport.tick()
     this.armFromPark(events)
     // `stop()` and the end of the piece both drop the gate on the transport side.
-    if (this.transport.state === 'stopped') {
-      this.consumedOnset = null
-      this.disarm()
-    }
+    if (this.transport.state === 'stopped') {}
     this.lastPosition = this.transport.positionTicks
     this.lastCursor = this.transport.cursorGeneration
killedBy: end, stop and reset clears the wait when the piece ends
statusReason: expected { waiting: false, …(2) } to deeply equal { waiting: false, …(2) }

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:184:9
     const events = this.transport.tick()
     this.armFromPark(events)
     // `stop()` and the end of the piece both drop the gate on the transport side.
-    if (this.transport.state === 'stopped') {
+    if (true) {
       this.consumedOnset = null
       this.disarm()
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ObjectLiteral
src/core/practice/waitmode.ts:190:12
     }
     this.lastPosition = this.transport.positionTicks
     this.lastCursor = this.transport.cursorGeneration
-    return { events, wait: this.state }
+    return {}
   }
 
killedBy: WaitModeController construction pumping a stopped transport stays idle and emits nothing
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/core/practice/waitmode.ts:194:28
   }
 
   /** One MIDI note-on. Credits the armed requirement and resumes when it is met. */
-  noteOn(note: Midi): void {
-    invariant(isValidMidi(note), `noteOn: ${note} is not a MIDI note number`)
-    // A key that never came up cannot be struck again — this is what stops a
-    // chord tone held over from the previous onset from satisfying this one.
-    if (this.down.has(note)) return
-    this.down.add(note)
-    if (!this.holding) return
-
-    if (this.requiredPitches.includes(note)) {
-      if (!this.satisfied.includes(note)) this.satisfied.push(note)
-      // Resumed here rather than at the next pump, so the music carries on from
-      // the instant of the press instead of the instant of the next frame.
-      if (this.isSatisfied()) this.openGate()
-    } else if (!this.allowExtra) {
-      this.satisfied = []
-    }
-    this.publish()
-  }
+  noteOn(note: Midi): void {}
 
   /** One MIDI note-off. Withdraws the credit for that pitch while the wait is up. */
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:198:9
     invariant(isValidMidi(note), `noteOn: ${note} is not a MIDI note number`)
     // A key that never came up cannot be struck again — this is what stops a
     // chord tone held over from the previous onset from satisfying this one.
-    if (this.down.has(note)) return
+    if (false) return
     this.down.add(note)
     if (!this.holding) return
killedBy: chords a key held over from the previous onset does not satisfy a repeated pitch
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:198:9
     invariant(isValidMidi(note), `noteOn: ${note} is not a MIDI note number`)
     // A key that never came up cannot be struck again — this is what stops a
     // chord tone held over from the previous onset from satisfying this one.
-    if (this.down.has(note)) return
+    if (true) return
     this.down.add(note)
     if (!this.holding) return
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:200:9
     // chord tone held over from the previous onset from satisfying this one.
     if (this.down.has(note)) return
     this.down.add(note)
-    if (!this.holding) return
+    if (this.holding) return
 
     if (this.requiredPitches.includes(note)) {
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:200:9
     // chord tone held over from the previous onset from satisfying this one.
     if (this.down.has(note)) return
     this.down.add(note)
-    if (!this.holding) return
+    if (true) return
 
     if (this.requiredPitches.includes(note)) {
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:202:9
     this.down.add(note)
     if (!this.holding) return
 
-    if (this.requiredPitches.includes(note)) {
+    if (true) {
       if (!this.satisfied.includes(note)) this.satisfied.push(note)
       // Resumed here rather than at the next pump, so the music carries on from
killedBy: wrong notes never advance the playhead
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/practice/waitmode.ts:202:46
     this.down.add(note)
     if (!this.holding) return
 
-    if (this.requiredPitches.includes(note)) {
-      if (!this.satisfied.includes(note)) this.satisfied.push(note)
-      // Resumed here rather than at the next pump, so the music carries on from
-      // the instant of the press instead of the instant of the next frame.
-      if (this.isSatisfied()) this.openGate()
-    } else if (!this.allowExtra) {
+    if (this.requiredPitches.includes(note)) {} else if (!this.allowExtra) {
       this.satisfied = []
     }
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:203:11
     if (!this.holding) return
 
     if (this.requiredPitches.includes(note)) {
-      if (!this.satisfied.includes(note)) this.satisfied.push(note)
+      if (this.satisfied.includes(note)) this.satisfied.push(note)
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:203:11
     if (!this.holding) return
 
     if (this.requiredPitches.includes(note)) {
-      if (!this.satisfied.includes(note)) this.satisfied.push(note)
+      if (false) this.satisfied.push(note)
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:206:11
       if (!this.satisfied.includes(note)) this.satisfied.push(note)
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
-      if (this.isSatisfied()) this.openGate()
+      if (true) this.openGate()
     } else if (!this.allowExtra) {
       this.satisfied = []
killedBy: chords holds until every note of the triad is down
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:206:11
       if (!this.satisfied.includes(note)) this.satisfied.push(note)
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
-      if (this.isSatisfied()) this.openGate()
+      if (false) this.openGate()
     } else if (!this.allowExtra) {
       this.satisfied = []
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:207:16
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
       if (this.isSatisfied()) this.openGate()
-    } else if (!this.allowExtra) {
+    } else if (this.allowExtra) {
       this.satisfied = []
     }
killedBy: wrong notes wipe the chord progress when allowExtraNotes is off
statusReason: expected [ 48, 52 ] to deeply equal []

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:207:16
       // Resumed here rather than at the next pump, so the music carries on from
       // the instant of the press instead of the instant of the next frame.
       if (this.isSatisfied()) this.openGate()
-    } else if (!this.allowExtra) {
+    } else if (false) {
       this.satisfied = []
     }
killedBy: wrong notes wipe the chord progress when allowExtraNotes is off
statusReason: expected [ 48, 52 ] to deeply equal []

[Killed] BlockStatement
src/core/practice/waitmode.ts:214:29
   }
 
   /** One MIDI note-off. Withdraws the credit for that pitch while the wait is up. */
-  noteOff(note: Midi): void {
-    invariant(isValidMidi(note), `noteOff: ${note} is not a MIDI note number`)
-    this.down.delete(note)
-    if (!this.holding) return
-    const index = this.satisfied.indexOf(note)
-    if (index < 0) return
-    this.satisfied.splice(index, 1)
-    this.publish()
-  }
+  noteOff(note: Midi): void {}
 
   /** Forget the armed wait and every key believed to be down, and let playback run. */
killedBy: chords withdraws a chord note that is released again before the chord completes
statusReason: expected [ 48, 52 ] to deeply equal [ 52 ]

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:217:9
   noteOff(note: Midi): void {
     invariant(isValidMidi(note), `noteOff: ${note} is not a MIDI note number`)
     this.down.delete(note)
-    if (!this.holding) return
+    if (this.holding) return
     const index = this.satisfied.indexOf(note)
     if (index < 0) return
killedBy: chords withdraws a chord note that is released again before the chord completes
statusReason: expected [ 48, 52 ] to deeply equal [ 52 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:217:9
   noteOff(note: Midi): void {
     invariant(isValidMidi(note), `noteOff: ${note} is not a MIDI note number`)
     this.down.delete(note)
-    if (!this.holding) return
+    if (true) return
     const index = this.satisfied.indexOf(note)
     if (index < 0) return
killedBy: chords withdraws a chord note that is released again before the chord completes
statusReason: expected [ 48, 52 ] to deeply equal [ 52 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:219:9
     this.down.delete(note)
     if (!this.holding) return
     const index = this.satisfied.indexOf(note)
-    if (index < 0) return
+    if (true) return
     this.satisfied.splice(index, 1)
     this.publish()
killedBy: chords withdraws a chord note that is released again before the chord completes
statusReason: expected [ 48, 52 ] to deeply equal [ 52 ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:219:9
     this.down.delete(note)
     if (!this.holding) return
     const index = this.satisfied.indexOf(note)
-    if (index < 0) return
+    if (index >= 0) return
     this.satisfied.splice(index, 1)
     this.publish()
killedBy: chords withdraws a chord note that is released again before the chord completes
statusReason: expected [ 48, 52 ] to deeply equal [ 52 ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:225:17
   }
 
   /** Forget the armed wait and every key believed to be down, and let playback run. */
-  reset(): void {
-    this.down.clear()
-    this.disarm()
-  }
+  reset(): void {}
 
   // ---------------------------------------------------------------- internals
killedBy: end, stop and reset reset drops the gate and lets playback carry on
statusReason: expected { waiting: true, …(2) } to deeply equal { waiting: false, …(2) }

[Killed] BlockStatement
src/core/practice/waitmode.ts:257:30
    * onset IS that last whole tick there is none left to stop on, so the fence
    * falls half way to the wrap.
    */
-  private armBarrier(): void {
-    const position = this.transport.positionTicks
-    const loop = this.transport.loop
-    const from = this.consumedOnset === position ? position + 1 : position
-    const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
-    const ahead = this.nextOwedOnset(from, limit)
-    if (ahead !== null || loop === null) {
-      this.armOnset(ahead)
-      return
-    }
-    const wrapped = this.nextOwedOnset(loop.startTick, loop.endTick)
-    if (wrapped === null || wrapped < position) {
-      this.armOnset(wrapped)
-      return
-    }
-    this.armedOnset = null
-    const lastWholeTick = Math.ceil(loop.endTick) - 1
-    const fence = Math.max(lastWholeTick, (position + loop.endTick) / 2)
-    this.transport.setBarrier(asTicks(fence))
-  }
+  private armBarrier(): void {}
 
   /** Tick of the first onset the learner owes in `[fromTick, limitTick)`, or `null`. */
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ArithmeticOperator
src/core/practice/waitmode.ts:260:52
   private armBarrier(): void {
     const position = this.transport.positionTicks
     const loop = this.transport.loop
-    const from = this.consumedOnset === position ? position + 1 : position
+    const from = this.consumedOnset === position ? position - 1 : position
     const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:260:18
   private armBarrier(): void {
     const position = this.transport.positionTicks
     const loop = this.transport.loop
-    const from = this.consumedOnset === position ? position + 1 : position
+    const from = true ? position + 1 : position
     const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:261:19
     const position = this.transport.positionTicks
     const loop = this.transport.loop
     const from = this.consumedOnset === position ? position + 1 : position
-    const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
+    const limit = true ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
     if (ahead !== null || loop === null) {
killedBy: looping re-arms the wait at the wrap point
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/practice/waitmode.ts:261:19
     const position = this.transport.positionTicks
     const loop = this.transport.loop
     const from = this.consumedOnset === position ? position + 1 : position
-    const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
+    const limit = loop !== null ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
     if (ahead !== null || loop === null) {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Cannot read properties of null (reading 'endTick')

[Killed] BlockStatement
src/core/practice/waitmode.ts:263:42
     const from = this.consumedOnset === position ? position + 1 : position
     const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
-    if (ahead !== null || loop === null) {
-      this.armOnset(ahead)
-      return
-    }
+    if (ahead !== null || loop === null) {}
     const wrapped = this.nextOwedOnset(loop.startTick, loop.endTick)
     if (wrapped === null || wrapped < position) {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Cannot read properties of null (reading 'startTick')

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:263:9
     const from = this.consumedOnset === position ? position + 1 : position
     const limit = loop === null ? Number.POSITIVE_INFINITY : loop.endTick
     const ahead = this.nextOwedOnset(from, limit)
-    if (ahead !== null || loop === null) {
+    if (true) {
       this.armOnset(ahead)
       return
killedBy: looping re-arms the wait at the wrap point
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:268:29
       return
     }
     const wrapped = this.nextOwedOnset(loop.startTick, loop.endTick)
-    if (wrapped === null || wrapped < position) {
+    if (wrapped === null || false) {
       this.armOnset(wrapped)
       return
killedBy: looping re-arms the wait at the wrap point
statusReason: expected [] to deeply equal [ 'off:62', 'loop:1', …(2) ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:268:29
       return
     }
     const wrapped = this.nextOwedOnset(loop.startTick, loop.endTick)
-    if (wrapped === null || wrapped < position) {
+    if (wrapped === null || wrapped >= position) {
       this.armOnset(wrapped)
       return
killedBy: looping re-arms the wait at the wrap point
statusReason: expected [] to deeply equal [ 'off:62', 'loop:1', …(2) ]
