[Killed] ArithmeticOperator
src/core/practice/waitmode.ts:273:27
       return
     }
     this.armedOnset = null
-    const lastWholeTick = Math.ceil(loop.endTick) - 1
+    const lastWholeTick = Math.ceil(loop.endTick) + 1
     const fence = Math.max(lastWholeTick, (position + loop.endTick) / 2)
     this.transport.setBarrier(asTicks(fence))
killedBy: looping re-arms after the wrap when the pass owes a single onset
statusReason: expected [ 'on:74', 'on:76', 'on:77', …(18) ] to deeply equal [ 'on:74', 'on:76', 'on:77', …(4) ]

[Killed] ArithmeticOperator
src/core/practice/waitmode.ts:274:43
     }
     this.armedOnset = null
     const lastWholeTick = Math.ceil(loop.endTick) - 1
-    const fence = Math.max(lastWholeTick, (position + loop.endTick) / 2)
+    const fence = Math.max(lastWholeTick, (position + loop.endTick) * 2)
     this.transport.setBarrier(asTicks(fence))
   }
killedBy: looping re-arms after the wrap when the pass owes a single onset
statusReason: expected [ 'on:74', 'on:76', 'on:77', …(18) ] to deeply equal [ 'on:74', 'on:76', 'on:77', …(4) ]

[Killed] ArithmeticOperator
src/core/practice/waitmode.ts:274:44
     }
     this.armedOnset = null
     const lastWholeTick = Math.ceil(loop.endTick) - 1
-    const fence = Math.max(lastWholeTick, (position + loop.endTick) / 2)
+    const fence = Math.max(lastWholeTick, (position - loop.endTick) / 2)
     this.transport.setBarrier(asTicks(fence))
   }
killedBy: looping fences half way when the onset is the last whole tick of the pass
statusReason: expected [] to deeply equal [ 'on:60' ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:279:77
   }
 
   /** Tick of the first onset the learner owes in `[fromTick, limitTick)`, or `null`. */
-  private nextOwedOnset(fromTick: number, limitTick: number): number | null {
-    const notes = this.score.notes
-    for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
-      const note = at(notes, i)
-      if (note.startTick >= limitTick) return null
-      if (this.isWaitedFor(note)) return note.startTick
-    }
-    return null
-  }
+  private nextOwedOnset(fromTick: number, limitTick: number): number | null {}
 
   private armOnset(tick: number | null): void {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: setBarrier: undefined is not a finite tick

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:281:50
   /** Tick of the first onset the learner owes in `[fromTick, limitTick)`, or `null`. */
   private nextOwedOnset(fromTick: number, limitTick: number): number | null {
     const notes = this.score.notes
-    for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
+    for (let i = firstNoteFrom(notes, fromTick); false; i++) {
       const note = at(notes, i)
       if (note.startTick >= limitTick) return null
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] UpdateOperator
src/core/practice/waitmode.ts:281:68
   /** Tick of the first onset the learner owes in `[fromTick, limitTick)`, or `null`. */
   private nextOwedOnset(fromTick: number, limitTick: number): number | null {
     const notes = this.score.notes
-    for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
+    for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i--) {
       const note = at(notes, i)
       if (note.startTick >= limitTick) return null
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: index -1 out of bounds (length 25)

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:283:11
     const notes = this.score.notes
     for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
       const note = at(notes, i)
-      if (note.startTick >= limitTick) return null
+      if (true) return null
       if (this.isWaitedFor(note)) return note.startTick
     }
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:283:11
     const notes = this.score.notes
     for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
       const note = at(notes, i)
-      if (note.startTick >= limitTick) return null
+      if (false) return null
       if (this.isWaitedFor(note)) return note.startTick
     }
killedBy: looping re-arms the wait at the wrap point
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:284:11
     for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
       const note = at(notes, i)
       if (note.startTick >= limitTick) return null
-      if (this.isWaitedFor(note)) return note.startTick
+      if (true) return note.startTick
     }
     return null
killedBy: holding at a required onset waits for nothing when no hand is waited for
statusReason: Invariant violated: wait mode armed at tick 0 with nothing to wait for

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:284:11
     for (let i = firstNoteFrom(notes, fromTick); i < notes.length; i++) {
       const note = at(notes, i)
       if (note.startTick >= limitTick) return null
-      if (this.isWaitedFor(note)) return note.startTick
+      if (false) return note.startTick
     }
     return null
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:289:47
     return null
   }
 
-  private armOnset(tick: number | null): void {
-    this.armedOnset = tick
-    this.transport.setBarrier(tick === null ? null : asTicks(tick))
-  }
+  private armOnset(tick: number | null): void {}
 
   /** Take up the wait if the pump parked the playhead on the onset we armed. */
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:291:31
 
   private armOnset(tick: number | null): void {
     this.armedOnset = tick
-    this.transport.setBarrier(tick === null ? null : asTicks(tick))
+    this.transport.setBarrier(tick !== null ? null : asTicks(tick))
   }
 
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:291:31
 
   private armOnset(tick: number | null): void {
     this.armedOnset = tick
-    this.transport.setBarrier(tick === null ? null : asTicks(tick))
+    this.transport.setBarrier(true ? null : asTicks(tick))
   }
 
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:295:64
   }
 
   /** Take up the wait if the pump parked the playhead on the onset we armed. */
-  private armFromPark(events: readonly TransportEvent[]): void {
-    const onset = this.armedOnset
-    if (onset === null || this.holding) return
-    if (!this.transport.isAtBarrier || this.transport.positionTicks !== onset) return
-    this.arm(onset, events)
-  }
+  private armFromPark(events: readonly TransportEvent[]): void {}
 
   private arm(tick: number, events: readonly TransportEvent[]): void {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:297:9
   /** Take up the wait if the pump parked the playhead on the onset we armed. */
   private armFromPark(events: readonly TransportEvent[]): void {
     const onset = this.armedOnset
-    if (onset === null || this.holding) return
+    if (onset !== null || this.holding) return
     if (!this.transport.isAtBarrier || this.transport.positionTicks !== onset) return
     this.arm(onset, events)
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] LogicalOperator
src/core/practice/waitmode.ts:297:9
   /** Take up the wait if the pump parked the playhead on the onset we armed. */
   private armFromPark(events: readonly TransportEvent[]): void {
     const onset = this.armedOnset
-    if (onset === null || this.holding) return
+    if (onset === null && this.holding) return
     if (!this.transport.isAtBarrier || this.transport.positionTicks !== onset) return
     this.arm(onset, events)
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:298:9
   private armFromPark(events: readonly TransportEvent[]): void {
     const onset = this.armedOnset
     if (onset === null || this.holding) return
-    if (!this.transport.isAtBarrier || this.transport.positionTicks !== onset) return
+    if (false) return
     this.arm(onset, events)
   }
killedBy: holding at a required onset the pump that drops the gate advances nothing by itself
statusReason: Invariant violated: wait mode parked the playhead on tick 480, where the transport sounded nothing — the controller and the transport must share one score

[Killed] LogicalOperator
src/core/practice/waitmode.ts:298:9
   private armFromPark(events: readonly TransportEvent[]): void {
     const onset = this.armedOnset
     if (onset === null || this.holding) return
-    if (!this.transport.isAtBarrier || this.transport.positionTicks !== onset) return
+    if (!this.transport.isAtBarrier && this.transport.positionTicks !== onset) return
     this.arm(onset, events)
   }
killedBy: WaitModeController properties keeps its invariants under an arbitrary stream of playing and pumping
statusReason: Property failed after 24 tests
{ seed: -400894316, path: "23:4:4:4", endOnFailure: true }
Counterexample: [[{"kind":"pause"},{"kind":"pump","ms":0}]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/practice/waitmode.ts:302:70
     this.arm(onset, events)
   }
 
-  private arm(tick: number, events: readonly TransportEvent[]): void {
-    // The pump parked on this tick because this controller's score says a note
-    // starts here. If the transport sounded something else instead, the two are
-    // reading different scores and every wait armed from here on is fiction.
-    invariant(
-      events.some((event) => event.type === 'noteOn' && event.note.startTick === tick),
-      `wait mode parked the playhead on tick ${tick}, where the transport sounded nothing — ` +
-        'the controller and the transport must share one score',
-    )
-    const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
-    invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
-    const pitches: Midi[] = []
-    for (const note of required) if (!pitches.includes(note.midi)) pitches.push(note.midi)
-    this.required = required
-    this.requiredPitches = pitches
-    this.satisfied = []
-    this.holding = true
-    this.consumedOnset = tick
-    this.transport.holdUntil(() => this.isSatisfied())
-    this.publish()
-  }
+  private arm(tick: number, events: readonly TransportEvent[]): void {}
 
   /**
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:307:57
     // starts here. If the transport sounded something else instead, the two are
     // reading different scores and every wait armed from here on is fiction.
     invariant(
-      events.some((event) => event.type === 'noteOn' && event.note.startTick === tick),
+      events.some((event) => event.type === 'noteOn' && event.note.startTick !== tick),
       `wait mode parked the playhead on tick ${tick}, where the transport sounded nothing — ` +
         'the controller and the transport must share one score',
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] EqualityOperator
src/core/practice/waitmode.ts:307:30
     // starts here. If the transport sounded something else instead, the two are
     // reading different scores and every wait armed from here on is fiction.
     invariant(
-      events.some((event) => event.type === 'noteOn' && event.note.startTick === tick),
+      events.some((event) => event.type !== 'noteOn' && event.note.startTick === tick),
       `wait mode parked the playhead on tick ${tick}, where the transport sounded nothing — ` +
         'the controller and the transport must share one score',
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Cannot read properties of undefined (reading 'startTick')

[Killed] MethodExpression
src/core/practice/waitmode.ts:311:22
       `wait mode parked the playhead on tick ${tick}, where the transport sounded nothing — ` +
         'the controller and the transport must share one score',
     )
-    const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
+    const required = notesAtTick(this.score, asTicks(tick))
     invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [ 48, 52, 55, 72 ] to deeply equal [ 72 ]

[Killed] ArrowFunction
src/core/practice/waitmode.ts:311:68
       `wait mode parked the playhead on tick ${tick}, where the transport sounded nothing — ` +
         'the controller and the transport must share one score',
     )
-    const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
+    const required = notesAtTick(this.score, asTicks(tick)).filter(() => undefined)
     invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: wait mode armed at tick 0 with nothing to wait for

[Killed] EqualityOperator
src/core/practice/waitmode.ts:312:15
         'the controller and the transport must share one score',
     )
     const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
-    invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
+    invariant(required.length <= 0, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
     for (const note of required) if (!pitches.includes(note.midi)) pitches.push(note.midi)
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: wait mode armed at tick 0 with nothing to wait for

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:312:15
         'the controller and the transport must share one score',
     )
     const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
-    invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
+    invariant(false, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
     for (const note of required) if (!pitches.includes(note.midi)) pitches.push(note.midi)
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: Invariant violated: wait mode armed at tick 0 with nothing to wait for

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:314:38
     const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
     invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
-    for (const note of required) if (!pitches.includes(note.midi)) pitches.push(note.midi)
+    for (const note of required) if (false) pitches.push(note.midi)
     this.required = required
     this.requiredPitches = pitches
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:314:38
     const required = notesAtTick(this.score, asTicks(tick)).filter((note) => this.isWaitedFor(note))
     invariant(required.length > 0, `wait mode armed at tick ${tick} with nothing to wait for`)
     const pitches: Midi[] = []
-    for (const note of required) if (!pitches.includes(note.midi)) pitches.push(note.midi)
+    for (const note of required) if (true) pitches.push(note.midi)
     this.required = required
     this.requiredPitches = pitches
killedBy: chords counts a doubled pitch once
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:318:20
     this.required = required
     this.requiredPitches = pitches
     this.satisfied = []
-    this.holding = true
+    this.holding = false
     this.consumedOnset = tick
     this.transport.holdUntil(() => this.isSatisfied())
killedBy: holding at a required onset arms on the first onset and freezes the playhead there
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/core/practice/waitmode.ts:320:30
     this.satisfied = []
     this.holding = true
     this.consumedOnset = tick
-    this.transport.holdUntil(() => this.isSatisfied())
+    this.transport.holdUntil(() => undefined)
     this.publish()
   }

[Killed] BlockStatement
src/core/practice/waitmode.ts:338:39
    * parked on — "play me that note again" — rewinds the cursor without moving the
    * playhead, and the onset would otherwise sound with no wait at all.
    */
-  private noticeMovedPlayhead(): void {
-    const rewound = this.transport.cursorGeneration !== this.lastCursor
-    const moved =
-      this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
-    if (!moved && (!this.holding || this.transport.isAtBarrier)) return
-    this.consumedOnset = null
-    this.disarm()
-  }
+  private noticeMovedPlayhead(): void {}
 
   /** Drop the gate and the barrier, leaving the requirement alone. */
killedBy: pause, seek, stop and tempo during a wait a seek during a wait re-arms on the new position
statusReason: expected [ 'off:62' ] to deeply equal [ 'off:62', 'on:64' ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:339:21
    * playhead, and the onset would otherwise sound with no wait at all.
    */
   private noticeMovedPlayhead(): void {
-    const rewound = this.transport.cursorGeneration !== this.lastCursor
+    const rewound = this.transport.cursorGeneration === this.lastCursor
     const moved =
       this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:339:21
    * playhead, and the onset would otherwise sound with no wait at all.
    */
   private noticeMovedPlayhead(): void {
-    const rewound = this.transport.cursorGeneration !== this.lastCursor
+    const rewound = false
     const moved =
       this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
killedBy: pause, seek, stop and tempo during a wait a seek to the tick the playhead is parked on waits for that onset again
statusReason: expected [ Array(4) ] to deeply equal [ 'off:62', 'on:62' ]

[Killed] EqualityOperator
src/core/practice/waitmode.ts:341:7
   private noticeMovedPlayhead(): void {
     const rewound = this.transport.cursorGeneration !== this.lastCursor
     const moved =
-      this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
+      this.lastPosition === null && (rewound || this.transport.positionTicks !== this.lastPosition)
     if (!moved && (!this.holding || this.transport.isAtBarrier)) return
     this.consumedOnset = null
killedBy: pause, seek, stop and tempo during a wait a seek to the tick the playhead is parked on waits for that onset again
statusReason: expected [ Array(4) ] to deeply equal [ 'off:62', 'on:62' ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:341:38
   private noticeMovedPlayhead(): void {
     const rewound = this.transport.cursorGeneration !== this.lastCursor
     const moved =
-      this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
+      this.lastPosition !== null && (true)
     if (!moved && (!this.holding || this.transport.isAtBarrier)) return
     this.consumedOnset = null
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] LogicalOperator
src/core/practice/waitmode.ts:342:20
     const rewound = this.transport.cursorGeneration !== this.lastCursor
     const moved =
       this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
-    if (!moved && (!this.holding || this.transport.isAtBarrier)) return
+    if (!moved && (!this.holding && this.transport.isAtBarrier)) return
     this.consumedOnset = null
     this.disarm()
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: Invariant violated: wait mode parked the playhead on tick 0, where the transport sounded nothing — the controller and the transport must share one score

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:342:9
     const rewound = this.transport.cursorGeneration !== this.lastCursor
     const moved =
       this.lastPosition !== null && (rewound || this.transport.positionTicks !== this.lastPosition)
-    if (!moved && (!this.holding || this.transport.isAtBarrier)) return
+    if (true) return
     this.consumedOnset = null
     this.disarm()
killedBy: pause, seek, stop and tempo during a wait a seek during a wait re-arms on the new position
statusReason: expected [ 'off:62' ] to deeply equal [ 'off:62', 'on:64' ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:348:28
   }
 
   /** Drop the gate and the barrier, leaving the requirement alone. */
-  private openGate(): void {
-    this.holding = false
-    this.armedOnset = null
-    this.transport.release()
-    this.transport.setBarrier(null)
-  }
+  private openGate(): void {}
 
   private disarm(): void {
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/practice/waitmode.ts:349:20
 
   /** Drop the gate and the barrier, leaving the requirement alone. */
   private openGate(): void {
-    this.holding = false
+    this.holding = true
     this.armedOnset = null
     this.transport.release()
killedBy: holding at a required onset re-arms on every following onset
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/practice/waitmode.ts:355:26
     this.transport.setBarrier(null)
   }
 
-  private disarm(): void {
-    if (!this.holding && this.required.length === 0 && this.armedOnset === null) return
-    this.required = NO_NOTES
-    this.requiredPitches = NO_PITCHES
-    this.satisfied = []
-    this.openGate()
-    this.publish()
-  }
+  private disarm(): void {}
 
   private isWaitedFor(note: ScoreNote): boolean {
killedBy: pause, seek, stop and tempo during a wait a seek during a wait re-arms on the new position
statusReason: expected [ 'off:62' ] to deeply equal [ 'off:62', 'on:64' ]

[Killed] LogicalOperator
src/core/practice/waitmode.ts:356:9
   }
 
   private disarm(): void {
-    if (!this.holding && this.required.length === 0 && this.armedOnset === null) return
+    if (!this.holding || this.required.length === 0 && this.armedOnset === null) return
     this.required = NO_NOTES
     this.requiredPitches = NO_PITCHES
killedBy: end, stop and reset clears the wait when the piece ends
statusReason: expected { waiting: false, …(2) } to deeply equal { waiting: false, …(2) }

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:356:26
   }
 
   private disarm(): void {
-    if (!this.holding && this.required.length === 0 && this.armedOnset === null) return
+    if (!this.holding && true && this.armedOnset === null) return
     this.required = NO_NOTES
     this.requiredPitches = NO_PITCHES
killedBy: end, stop and reset clears the wait when the piece ends
statusReason: expected { waiting: false, …(2) } to deeply equal { waiting: false, …(2) }

[Killed] BlockStatement
src/core/practice/waitmode.ts:364:49
     this.publish()
   }
 
-  private isWaitedFor(note: ScoreNote): boolean {
-    if (note.tiedFrom) return false
-    return this.hands === null || this.hands.includes(note.hand)
-  }
+  private isWaitedFor(note: ScoreNote): boolean {}
 
   /**
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:365:9
   }
 
   private isWaitedFor(note: ScoreNote): boolean {
-    if (note.tiedFrom) return false
+    if (false) return false
     return this.hands === null || this.hands.includes(note.hand)
   }
killedBy: ties never waits for a tied continuation
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:365:9
   }
 
   private isWaitedFor(note: ScoreNote): boolean {
-    if (note.tiedFrom) return false
+    if (true) return false
     return this.hands === null || this.hands.includes(note.hand)
   }
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] LogicalOperator
src/core/practice/waitmode.ts:366:12
 
   private isWaitedFor(note: ScoreNote): boolean {
     if (note.tiedFrom) return false
-    return this.hands === null || this.hands.includes(note.hand)
+    return this.hands === null && this.hands.includes(note.hand)
   }
 
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:366:12
 
   private isWaitedFor(note: ScoreNote): boolean {
     if (note.tiedFrom) return false
-    return this.hands === null || this.hands.includes(note.hand)
+    return false
   }
 
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] BlockStatement
src/core/practice/waitmode.ts:374:34
    * `arm` is the only place that installs the predicate and it refuses to arm an
    * empty requirement, and both `disarm` and a met requirement drop the gate.
    */
-  private isSatisfied(): boolean {
-    return this.requireAll
-      ? this.satisfied.length === this.requiredPitches.length
-      : this.satisfied.length > 0
-  }
+  private isSatisfied(): boolean {}
 
   /**
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/practice/waitmode.ts:376:9
    */
   private isSatisfied(): boolean {
     return this.requireAll
-      ? this.satisfied.length === this.requiredPitches.length
+      ? this.satisfied.length !== this.requiredPitches.length
       : this.satisfied.length > 0
   }
killedBy: holding at a required onset does not move the playhead however long the clock runs on
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:376:9
    */
   private isSatisfied(): boolean {
     return this.requireAll
-      ? this.satisfied.length === this.requiredPitches.length
+      ? false
       : this.satisfied.length > 0
   }
killedBy: holding at a required onset releases within the same update and loses no musical time
statusReason: expected true to be false // Object.is equality
