[Killed] EqualityOperator
src/core/practice/waitmode.ts:377:9
   private isSatisfied(): boolean {
     return this.requireAll
       ? this.satisfied.length === this.requiredPitches.length
-      : this.satisfied.length > 0
+      : this.satisfied.length <= 0
   }
 
killedBy: chords releases on the first note when requireAllChordNotes is off
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:377:9
   private isSatisfied(): boolean {
     return this.requireAll
       ? this.satisfied.length === this.requiredPitches.length
-      : this.satisfied.length > 0
+      : false
   }
 
killedBy: chords releases on the first note when requireAllChordNotes is off
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/practice/waitmode.ts:386:32
    * the two, so it stops reporting a wait the moment it happens rather than at the
    * next pump.
    */
-  private isWaiting(): boolean {
-    return this.holding && this.transport.state === 'waiting' && this.transport.isAtBarrier
-  }
+  private isWaiting(): boolean {}
 
   private publish(): void {
killedBy: holding at a required onset arms on the first onset and freezes the playhead there
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:387:28
    * next pump.
    */
   private isWaiting(): boolean {
-    return this.holding && this.transport.state === 'waiting' && this.transport.isAtBarrier
+    return this.holding && true && this.transport.isAtBarrier
   }
 
killedBy: pause, seek, stop and tempo during a wait a pause during a wait is not a wait
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:387:12
    * next pump.
    */
   private isWaiting(): boolean {
-    return this.holding && this.transport.state === 'waiting' && this.transport.isAtBarrier
+    return false
   }
 
killedBy: holding at a required onset arms on the first onset and freezes the playhead there
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/practice/waitmode.ts:390:27
     return this.holding && this.transport.state === 'waiting' && this.transport.isAtBarrier
   }
 
-  private publish(): void {
-    this.snapshot =
-      !this.holding && this.required.length === 0
-        ? IDLE
-        : {
-            waiting: this.isWaiting(),
-            requiredNotes: this.required,
-            satisfiedNotes: [...this.satisfied],
-          }
-  }
+  private publish(): void {}
 }
 
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:392:7
 
   private publish(): void {
     this.snapshot =
-      !this.holding && this.required.length === 0
+      true
         ? IDLE
         : {
killedBy: WaitModeController construction copies the hands array, so a later mutation cannot change what is waited for
statusReason: expected [] to deeply equal [ 72 ]

[Killed] ConditionalExpression
src/core/practice/waitmode.ts:392:24
 
   private publish(): void {
     this.snapshot =
-      !this.holding && this.required.length === 0
+      !this.holding && true
         ? IDLE
         : {
killedBy: chords holds until every note of the triad is down
statusReason: expected [] to deeply equal [ 48, 52, 55 ]
