[Killed] BlockStatement
src/core/practice/matcher.ts:133:66
 
 type MutedNote = { readonly midi: number; readonly ms: number }
 
-function requireNonNegative(value: number, name: string): number {
-  invariant(
-    Number.isFinite(value) && value >= 0,
-    `${name} must be a finite number >= 0, got ${value}`,
-  )
-  return value
-}
+function requireNonNegative(value: number, name: string): number {}
 
 function requireTime(value: number, where: string): number {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ { verdict: 'missed', …(2) }, …(8) ] to have a length of 1 but got 9

[Killed] EqualityOperator
src/core/practice/matcher.ts:135:31
 
 function requireNonNegative(value: number, name: string): number {
   invariant(
-    Number.isFinite(value) && value >= 0,
+    Number.isFinite(value) && value < 0,
     `${name} must be a finite number >= 0, got ${value}`,
   )
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: toleranceMs must be a finite number >= 0, got 150

[Killed] EqualityOperator
src/core/practice/matcher.ts:135:31
 
 function requireNonNegative(value: number, name: string): number {
   invariant(
-    Number.isFinite(value) && value >= 0,
+    Number.isFinite(value) && value > 0,
     `${name} must be a finite number >= 0, got ${value}`,
   )
killedBy: NoteMatcher — chords honours a chordWindowMs of 0 — every chord note is judged on its own
statusReason: Invariant violated: chordWindowMs must be a finite number >= 0, got 0

[Killed] BlockStatement
src/core/practice/matcher.ts:141:60
   return value
 }
 
-function requireTime(value: number, where: string): number {
-  invariant(Number.isFinite(value), `${where}: atMs must be a finite time, got ${value}`)
-  return value
-}
+function requireTime(value: number, where: string): number {}
 
 /**
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:156:91
  * Notes arrive sorted by tick and `tickToMs` is monotonic, so the resulting `ms`
  * array is non-decreasing — the ordering every cursor in the matcher relies on.
  */
-function buildExpected(notes: readonly ScoreNote[], tempo: TempoMap): readonly Expected[] {
-  const sizes = new Array<number>(notes.length).fill(1)
-  let start = 0
-  for (let i = 1; i <= notes.length; i++) {
-    if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
-      for (let j = start; j < i; j++) sizes[j] = i - start
-      start = i
-    }
-  }
-  return notes.map((note, i) => ({
-    note,
-    ms: tickToMs(tempo, note.startTick) as number,
-    chordSize: at(sizes, i),
-  }))
-}
+function buildExpected(notes: readonly ScoreNote[], tempo: TempoMap): readonly Expected[] {}
 
 export class NoteMatcher {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] ArrayDeclaration
src/core/practice/matcher.ts:157:17
  * array is non-decreasing — the ordering every cursor in the matcher relies on.
  */
 function buildExpected(notes: readonly ScoreNote[], tempo: TempoMap): readonly Expected[] {
-  const sizes = new Array<number>(notes.length).fill(1)
+  const sizes = new Array().fill(1)
   let start = 0
   for (let i = 1; i <= notes.length; i++) {

[Killed] UpdateOperator
src/core/practice/matcher.ts:159:38
 function buildExpected(notes: readonly ScoreNote[], tempo: TempoMap): readonly Expected[] {
   const sizes = new Array<number>(notes.length).fill(1)
   let start = 0
-  for (let i = 1; i <= notes.length; i++) {
+  for (let i = 1; i <= notes.length; i--) {
     if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
       for (let j = start; j < i; j++) sizes[j] = i - start
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index -1 out of bounds (length 8)

[Killed] EqualityOperator
src/core/practice/matcher.ts:159:19
 function buildExpected(notes: readonly ScoreNote[], tempo: TempoMap): readonly Expected[] {
   const sizes = new Array<number>(notes.length).fill(1)
   let start = 0
-  for (let i = 1; i <= notes.length; i++) {
+  for (let i = 1; i > notes.length; i++) {
     if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
       for (let j = start; j < i; j++) sizes[j] = i - start
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 1 out of bounds (length 0)

[Killed] LogicalOperator
src/core/practice/matcher.ts:160:9
   const sizes = new Array<number>(notes.length).fill(1)
   let start = 0
   for (let i = 1; i <= notes.length; i++) {
-    if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
+    if (i === notes.length && at(notes, i).startTick !== at(notes, start).startTick) {
       for (let j = start; j < i; j++) sizes[j] = i - start
       start = i
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 8 out of bounds (length 8)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:160:31
   const sizes = new Array<number>(notes.length).fill(1)
   let start = 0
   for (let i = 1; i <= notes.length; i++) {
-    if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
+    if (i === notes.length || false) {
       for (let j = start; j < i; j++) sizes[j] = i - start
       start = i
killedBy: NoteMatcher — chords does not widen the onTime band for a note that is not in a chord
statusReason: expected 'onTime' to be 'late' // Object.is equality

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:161:50
   let start = 0
   for (let i = 1; i <= notes.length; i++) {
     if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
-      for (let j = start; j < i; j++) sizes[j] = i - start
+      for (let j = start; j < i; j++) sizes[j] = i + start
       start = i
     }
killedBy: NoteMatcher — a chord is a shared onset, not a short gap gives every note of an even run the same verdict for the same error
statusReason: expected [ 'late', 'onTime', 'onTime', …(2) ] to deeply equal [ Array(5) ]

[Killed] EqualityOperator
src/core/practice/matcher.ts:161:27
   let start = 0
   for (let i = 1; i <= notes.length; i++) {
     if (i === notes.length || at(notes, i).startTick !== at(notes, start).startTick) {
-      for (let j = start; j < i; j++) sizes[j] = i - start
+      for (let j = start; j >= i; j++) sizes[j] = i - start
       start = i
     }
killedBy: NoteMatcher — chords treats a chord rolled inside chordWindowMs as simultaneous
statusReason: expected [ 'onTime', 'onTime', 'late' ] to deeply equal [ 'onTime', 'onTime', 'onTime' ]

[Killed] ArrowFunction
src/core/practice/matcher.ts:165:20
       start = i
     }
   }
-  return notes.map((note, i) => ({
-    note,
-    ms: tickToMs(tempo, note.startTick) as number,
-    chordSize: at(sizes, i),
-  }))
+  return notes.map(() => undefined)
 }
 
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 0 out of bounds (length 8)

[Killed] ObjectLiteral
src/core/practice/matcher.ts:165:34
       start = i
     }
   }
-  return notes.map((note, i) => ({
-    note,
-    ms: tickToMs(tempo, note.startTick) as number,
-    chordSize: at(sizes, i),
-  }))
+  return notes.map((note, i) => ({}))
 }
 
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ { verdict: 'missed', …(2) }, …(8) ] to have a length of 1 but got 9

[Killed] UnaryOperator
src/core/practice/matcher.ts:188:19
   /** Lowest expected index that is still undecided — the window's left edge. */
   private lo = 0
   private mutedLo = 0
-  private nowMs = -Infinity
+  private nowMs = +Infinity
   /** Pitches matched correctly and still inside their tolerance window. */
   private recent: { midi: number; ms: number }[] = []
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ { verdict: 'missed', …(2) }, …(8) ] to have a length of 1 but got 9

[Killed] LogicalOperator
src/core/practice/matcher.ts:202:7
 
   constructor(score: Score, tempo: TempoMap, settings: MatcherSettings = {}) {
     this.tolerance = requireNonNegative(
-      settings.toleranceMs ?? MATCHER_DEFAULTS.toleranceMs,
+      settings.toleranceMs && MATCHER_DEFAULTS.toleranceMs,
       'toleranceMs',
     )
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: toleranceMs must be a finite number >= 0, got undefined

[Survived] StringLiteral
src/core/practice/matcher.ts:203:7
   constructor(score: Score, tempo: TempoMap, settings: MatcherSettings = {}) {
     this.tolerance = requireNonNegative(
       settings.toleranceMs ?? MATCHER_DEFAULTS.toleranceMs,
-      'toleranceMs',
+      "",
     )
     this.onTime = requireNonNegative(settings.onTimeMs ?? MATCHER_DEFAULTS.onTimeMs, 'onTimeMs')

[Killed] LogicalOperator
src/core/practice/matcher.ts:205:38
       settings.toleranceMs ?? MATCHER_DEFAULTS.toleranceMs,
       'toleranceMs',
     )
-    this.onTime = requireNonNegative(settings.onTimeMs ?? MATCHER_DEFAULTS.onTimeMs, 'onTimeMs')
+    this.onTime = requireNonNegative(settings.onTimeMs && MATCHER_DEFAULTS.onTimeMs, 'onTimeMs')
     this.chordWindow = requireNonNegative(
       settings.chordWindowMs ?? MATCHER_DEFAULTS.chordWindowMs,
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: onTimeMs must be a finite number >= 0, got undefined

[Survived] StringLiteral
src/core/practice/matcher.ts:205:86
       settings.toleranceMs ?? MATCHER_DEFAULTS.toleranceMs,
       'toleranceMs',
     )
-    this.onTime = requireNonNegative(settings.onTimeMs ?? MATCHER_DEFAULTS.onTimeMs, 'onTimeMs')
+    this.onTime = requireNonNegative(settings.onTimeMs ?? MATCHER_DEFAULTS.onTimeMs, "")
     this.chordWindow = requireNonNegative(
       settings.chordWindowMs ?? MATCHER_DEFAULTS.chordWindowMs,

[Killed] LogicalOperator
src/core/practice/matcher.ts:207:7
     )
     this.onTime = requireNonNegative(settings.onTimeMs ?? MATCHER_DEFAULTS.onTimeMs, 'onTimeMs')
     this.chordWindow = requireNonNegative(
-      settings.chordWindowMs ?? MATCHER_DEFAULTS.chordWindowMs,
+      settings.chordWindowMs && MATCHER_DEFAULTS.chordWindowMs,
       'chordWindowMs',
     )
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: chordWindowMs must be a finite number >= 0, got undefined

[Killed] LogicalOperator
src/core/practice/matcher.ts:210:25
       settings.chordWindowMs ?? MATCHER_DEFAULTS.chordWindowMs,
       'chordWindowMs',
     )
-    this.ignoreOctave = settings.ignoreOctaveErrors ?? false
+    this.ignoreOctave = settings.ignoreOctaveErrors && false
 
     const hands = settings.hands
killedBy: NoteMatcher — octave errors accepts a note played an octave low when ignoreOctaveErrors is on
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] BooleanLiteral
src/core/practice/matcher.ts:210:56
       settings.chordWindowMs ?? MATCHER_DEFAULTS.chordWindowMs,
       'chordWindowMs',
     )
-    this.ignoreOctave = settings.ignoreOctaveErrors ?? false
+    this.ignoreOctave = settings.ignoreOctaveErrors ?? true
 
     const hands = settings.hands
killedBy: NoteMatcher — octave errors calls a note played an octave low a wrongPitch by default
statusReason: expected 'correct' to be 'wrongPitch' // Object.is equality

[Killed] MethodExpression
src/core/practice/matcher.ts:214:22
 
     const hands = settings.hands
     // A tied continuation is sustained, not struck: it is never expected.
-    const playable = score.notes.filter((n) => !n.tiedFrom)
+    const playable = score.notes
     const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
     this.expected = buildExpected(active, tempo)
killedBy: NoteMatcher — tied notes never expects a key press for a tied continuation
statusReason: expected [ …(4) ] to have a length of 3 but got 4

[Killed] BooleanLiteral
src/core/practice/matcher.ts:214:48
 
     const hands = settings.hands
     // A tied continuation is sustained, not struck: it is never expected.
-    const playable = score.notes.filter((n) => !n.tiedFrom)
+    const playable = score.notes.filter((n) => n.tiedFrom)
     const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
     this.expected = buildExpected(active, tempo)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:215:20
     const hands = settings.hands
     // A tied continuation is sustained, not struck: it is never expected.
     const playable = score.notes.filter((n) => !n.tiedFrom)
-    const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
+    const active = hands !== undefined ? playable : playable.filter((n) => hands.includes(n.hand))
     this.expected = buildExpected(active, tempo)
     this.muted =
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] MethodExpression
src/core/practice/matcher.ts:215:53
     const hands = settings.hands
     // A tied continuation is sustained, not struck: it is never expected.
     const playable = score.notes.filter((n) => !n.tiedFrom)
-    const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
+    const active = hands === undefined ? playable : playable
     this.expected = buildExpected(active, tempo)
     this.muted =
killedBy: NoteMatcher — hand filtering expects only the chosen hand
statusReason: expected [ …(25) ] to have a length of 13 but got 25

[Killed] EqualityOperator
src/core/practice/matcher.ts:218:7
     const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
     this.expected = buildExpected(active, tempo)
     this.muted =
-      hands === undefined
+      hands !== undefined
         ? []
         : playable
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
src/core/practice/matcher.ts:218:7
     const active = hands === undefined ? playable : playable.filter((n) => hands.includes(n.hand))
     this.expected = buildExpected(active, tempo)
     this.muted =
-      hands === undefined
+      false
         ? []
         : playable
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] ArrayDeclaration
src/core/practice/matcher.ts:219:11
     this.expected = buildExpected(active, tempo)
     this.muted =
       hands === undefined
-        ? []
+        ? ["Stryker was here"]
         : playable
             .filter((n) => !hands.includes(n.hand))

[Survived] MethodExpression
src/core/practice/matcher.ts:220:11
     this.muted =
       hands === undefined
         ? []
-        : playable
-            .filter((n) => !hands.includes(n.hand))
+        : playable
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
     this.decided = new Array<boolean>(this.expected.length).fill(false)

[Killed] BooleanLiteral
src/core/practice/matcher.ts:221:28
       hands === undefined
         ? []
         : playable
-            .filter((n) => !hands.includes(n.hand))
+            .filter((n) => hands.includes(n.hand))
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
     this.decided = new Array<boolean>(this.expected.length).fill(false)
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/core/practice/matcher.ts:221:21
       hands === undefined
         ? []
         : playable
-            .filter((n) => !hands.includes(n.hand))
+            .filter(() => undefined)
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
     this.decided = new Array<boolean>(this.expected.length).fill(false)
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/core/practice/matcher.ts:222:18
         ? []
         : playable
             .filter((n) => !hands.includes(n.hand))
-            .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
+            .map(() => undefined)
     this.decided = new Array<boolean>(this.expected.length).fill(false)
     this.charged = new Array<boolean>(this.expected.length).fill(false)
killedBy: NoteMatcher — hand filtering scores a right-hand-only run as perfect and never misses the muted hand
statusReason: Invariant violated: index 0 out of bounds (length 12)

[Killed] BooleanLiteral
src/core/practice/matcher.ts:223:66
         : playable
             .filter((n) => !hands.includes(n.hand))
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
-    this.decided = new Array<boolean>(this.expected.length).fill(false)
+    this.decided = new Array<boolean>(this.expected.length).fill(true)
     this.charged = new Array<boolean>(this.expected.length).fill(false)
   }
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Survived] ArrayDeclaration
src/core/practice/matcher.ts:223:20
         : playable
             .filter((n) => !hands.includes(n.hand))
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
-    this.decided = new Array<boolean>(this.expected.length).fill(false)
+    this.decided = new Array().fill(false)
     this.charged = new Array<boolean>(this.expected.length).fill(false)
   }

[Killed] BooleanLiteral
src/core/practice/matcher.ts:224:66
             .filter((n) => !hands.includes(n.hand))
             .map((n) => ({ midi: n.midi, ms: tickToMs(tempo, n.startTick) as number }))
     this.decided = new Array<boolean>(this.expected.length).fill(false)
-    this.charged = new Array<boolean>(this.expected.length).fill(false)
+    this.charged = new Array<boolean>(this.expected.length).fill(true)
   }
 
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Killed] BlockStatement
src/core/practice/matcher.ts:235:60
    * this press's own verdict. An event that arrives out of order is judged (and
    * recorded) at the clock's current value, never in the past.
    */
-  noteOn(note: Midi, atMs: Millis): readonly MatchResult[] {
-    invariant(isValidMidi(note), `noteOn: ${note} is not a MIDI note number`)
-    const produced: MatchResult[] = []
-    this.closeWindows(requireTime(atMs, 'noteOn'), produced)
-    this.held.add(note)
-    this.classify(note, this.nowMs, produced)
-    return produced
-  }
+  noteOn(note: Midi, atMs: Millis): readonly MatchResult[] {}
 
   /** Release. Nothing is decided on a release; it only clears the held-key set. */
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/core/practice/matcher.ts:245:43
   }
 
   /** Release. Nothing is decided on a release; it only clears the held-key set. */
-  noteOff(note: Midi, atMs: Millis): void {
-    invariant(isValidMidi(note), `noteOff: ${note} is not a MIDI note number`)
-    requireTime(atMs, 'noteOff')
-    this.held.delete(note)
-  }
+  noteOff(note: Midi, atMs: Millis): void {}
 
   /** Advance the internal clock: expected notes whose window has closed become `missed`. */
killedBy: NoteMatcher — state, reset and held keys tracks which keys are down
statusReason: expected [ 60, 64 ] to deeply equal [ 64 ]

[Survived] StringLiteral
src/core/practice/matcher.ts:246:34
 
   /** Release. Nothing is decided on a release; it only clears the held-key set. */
   noteOff(note: Midi, atMs: Millis): void {
-    invariant(isValidMidi(note), `noteOff: ${note} is not a MIDI note number`)
+    invariant(isValidMidi(note), ``)
     requireTime(atMs, 'noteOff')
     this.held.delete(note)

[Killed] BlockStatement
src/core/practice/matcher.ts:252:51
   }
 
   /** Advance the internal clock: expected notes whose window has closed become `missed`. */
-  advanceTo(atMs: Millis): readonly MatchResult[] {
-    const produced: MatchResult[] = []
-    this.closeWindows(requireTime(atMs, 'advanceTo'), produced)
-    return produced
-  }
+  advanceTo(atMs: Millis): readonly MatchResult[] {}
 
   // ------------------------------------------------------------------ queries
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/core/practice/matcher.ts:261:41
   // ------------------------------------------------------------------ queries
 
   /** Everything decided so far, in order. Also non-decreasing in `atMs`. */
-  get results(): readonly MatchResult[] {
-    return this.out
-  }
+  get results(): readonly MatchResult[] {}
 
   /** Keys currently down, for the UI keyboard overlay. */
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/core/practice/matcher.ts:266:36
   }
 
   /** Keys currently down, for the UI keyboard overlay. */
-  get heldNotes(): readonly Midi[] {
-    return [...this.held]
-  }
+  get heldNotes(): readonly Midi[] {}
 
   /**
killedBy: NoteMatcher — state, reset and held keys tracks which keys are down
statusReason: matcher.heldNotes is not iterable

[Killed] ArrayDeclaration
src/core/practice/matcher.ts:267:12
 
   /** Keys currently down, for the UI keyboard overlay. */
   get heldNotes(): readonly Midi[] {
-    return [...this.held]
+    return []
   }
 
killedBy: NoteMatcher — state, reset and held keys tracks which keys are down
statusReason: expected [] to deeply equal [ 60, 64 ]

[Killed] BlockStatement
src/core/practice/matcher.ts:276:27
    * observable — it must stay linear in the number of events, never quadratic in
    * the length of the score. Not part of the practice model; do not show it.
    */
-  get scanSteps(): number {
-    return this.steps
-  }
+  get scanSteps(): number {}
 
   /**
killedBy: NoteMatcher — cost model spends a bounded number of scan steps per event, however long the score
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/core/practice/matcher.ts:285:54
    * leading run of these. Pass `limit` when only the first few are wanted; the
    * UI cursor should use `nextPending()`.
    */
-  pendingNotes(limit?: number): readonly ScoreNote[] {
-    const max = limit ?? Number.POSITIVE_INFINITY
-    invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
-    const out: ScoreNote[] = []
-    for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
-      if (this.decided[i] === true) continue
-      out.push(at(this.expected, i).note)
-    }
-    return out
-  }
+  pendingNotes(limit?: number): readonly ScoreNote[] {}
 
   /** The note the UI cursor sits on: first undecided expected note, if any. */
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/core/practice/matcher.ts:286:17
    * UI cursor should use `nextPending()`.
    */
   pendingNotes(limit?: number): readonly ScoreNote[] {
-    const max = limit ?? Number.POSITIVE_INFINITY
+    const max = limit && Number.POSITIVE_INFINITY
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: pendingNotes: limit must be a number >= 0, got undefined

[Killed] EqualityOperator
src/core/practice/matcher.ts:287:15
    */
   pendingNotes(limit?: number): readonly ScoreNote[] {
     const max = limit ?? Number.POSITIVE_INFINITY
-    invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
+    invariant(max < 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
     for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: pendingNotes: limit must be a number >= 0, got undefined

[Killed] ConditionalExpression
src/core/practice/matcher.ts:287:15
    */
   pendingNotes(limit?: number): readonly ScoreNote[] {
     const max = limit ?? Number.POSITIVE_INFINITY
-    invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
+    invariant(true, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
     for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
killedBy: NoteMatcher — the pending cursor honours a limit without changing what it lists
statusReason: expected function to throw an error, but it didn't

[Killed] ArrayDeclaration
src/core/practice/matcher.ts:288:30
   pendingNotes(limit?: number): readonly ScoreNote[] {
     const max = limit ?? Number.POSITIVE_INFINITY
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
-    const out: ScoreNote[] = []
+    const out: ScoreNote[] = ["Stryker was here"]
     for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
       if (this.decided[i] === true) continue
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/core/practice/matcher.ts:289:27
     const max = limit ?? Number.POSITIVE_INFINITY
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
-    for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
+    for (let i = this.lo; i >= this.expected.length && out.length < max; i++) {
       if (this.decided[i] === true) continue
       out.push(at(this.expected, i).note)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 8 out of bounds (length 8)

[Killed] EqualityOperator
src/core/practice/matcher.ts:289:55
     const max = limit ?? Number.POSITIVE_INFINITY
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
-    for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
+    for (let i = this.lo; i < this.expected.length && out.length >= max; i++) {
       if (this.decided[i] === true) continue
       out.push(at(this.expected, i).note)
killedBy: NoteMatcher — a run-through with no mistakes starts with every expected note pending and empties as they are played
statusReason: expected [] to have a length of 8 but got +0

[Killed] ConditionalExpression
src/core/practice/matcher.ts:290:11
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
     for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
-      if (this.decided[i] === true) continue
+      if (false) continue
       out.push(at(this.expected, i).note)
     }
killedBy: NoteMatcher — a run-through with no mistakes starts with every expected note pending and empties as they are played
statusReason: expected [ …(8) ] to have a length of 7 but got 8

[Killed] EqualityOperator
src/core/practice/matcher.ts:290:11
     invariant(max >= 0, `pendingNotes: limit must be a number >= 0, got ${limit}`)
     const out: ScoreNote[] = []
     for (let i = this.lo; i < this.expected.length && out.length < max; i++) {
-      if (this.decided[i] === true) continue
+      if (this.decided[i] !== true) continue
       out.push(at(this.expected, i).note)
     }
killedBy: NoteMatcher — a run-through with no mistakes starts with every expected note pending and empties as they are played
statusReason: expected [] to have a length of 8 but got +0
