[Killed] BlockStatement
src/core/practice/matcher.ts:297:40
   }
 
   /** The note the UI cursor sits on: first undecided expected note, if any. */
-  nextPending(): ScoreNote | undefined {
-    for (let i = this.lo; i < this.expected.length; i++) {
-      if (this.decided[i] !== true) return at(this.expected, i).note
-    }
-    return undefined
-  }
+  nextPending(): ScoreNote | undefined {}
 
   /** Aggregate for the review overlay. */
killedBy: NoteMatcher — the pending cursor points nextPending at the first note pendingNotes lists
statusReason: expected undefined to be { midi: 60, startTick: +0, …(10) } // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:298:58
 
   /** The note the UI cursor sits on: first undecided expected note, if any. */
   nextPending(): ScoreNote | undefined {
-    for (let i = this.lo; i < this.expected.length; i++) {
-      if (this.decided[i] !== true) return at(this.expected, i).note
-    }
+    for (let i = this.lo; i < this.expected.length; i++) {}
     return undefined
   }
killedBy: NoteMatcher — the pending cursor points nextPending at the first note pendingNotes lists
statusReason: expected undefined to be { midi: 60, startTick: +0, …(10) } // Object.is equality

[Killed] UpdateOperator
src/core/practice/matcher.ts:298:53
 
   /** The note the UI cursor sits on: first undecided expected note, if any. */
   nextPending(): ScoreNote | undefined {
-    for (let i = this.lo; i < this.expected.length; i++) {
+    for (let i = this.lo; i < this.expected.length; i--) {
       if (this.decided[i] !== true) return at(this.expected, i).note
     }
killedBy: NoteMatcher — the pending cursor points nextPending at the first note pendingNotes lists
statusReason: Invariant violated: index -1 out of bounds (length 8)

[Killed] BooleanLiteral
src/core/practice/matcher.ts:299:31
   /** The note the UI cursor sits on: first undecided expected note, if any. */
   nextPending(): ScoreNote | undefined {
     for (let i = this.lo; i < this.expected.length; i++) {
-      if (this.decided[i] !== true) return at(this.expected, i).note
+      if (this.decided[i] !== false) return at(this.expected, i).note
     }
     return undefined
killedBy: NoteMatcher — the pending cursor points nextPending at the first note pendingNotes lists
statusReason: expected undefined to be { midi: 60, startTick: +0, …(10) } // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:299:11
   /** The note the UI cursor sits on: first undecided expected note, if any. */
   nextPending(): ScoreNote | undefined {
     for (let i = this.lo; i < this.expected.length; i++) {
-      if (this.decided[i] !== true) return at(this.expected, i).note
+      if (this.decided[i] === true) return at(this.expected, i).note
     }
     return undefined
killedBy: NoteMatcher — the pending cursor points nextPending at the first note pendingNotes lists
statusReason: expected undefined to be { midi: 60, startTick: +0, …(10) } // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:305:27
   }
 
   /** Aggregate for the review overlay. */
-  summary(): MatchSummary {
-    const total = this.correctCount + this.wrongPitchCount + this.missedCount + this.extraCount
-    return {
-      correct: this.correctCount,
-      wrongPitch: this.wrongPitchCount,
-      missed: this.missedCount,
-      extra: this.extraCount,
-      accuracy: total === 0 ? 1 : this.correctCount / total,
-      meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
-    }
-  }
+  summary(): MatchSummary {}
 
   /** Back to bar one: every note pending again, every counter zero. */
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected undefined to deeply equal { correct: 8, wrongPitch: +0, …(4) }

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:306:19
 
   /** Aggregate for the review overlay. */
   summary(): MatchSummary {
-    const total = this.correctCount + this.wrongPitchCount + this.missedCount + this.extraCount
+    const total = this.correctCount - this.wrongPitchCount + this.missedCount + this.extraCount
     return {
       correct: this.correctCount,
killedBy: NoteMatcher — wrong note, then the right one credits the correction and charges the fumble once
statusReason: expected 1 to be 0.5 // Object.is equality

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:306:19
 
   /** Aggregate for the review overlay. */
   summary(): MatchSummary {
-    const total = this.correctCount + this.wrongPitchCount + this.missedCount + this.extraCount
+    const total = this.correctCount + this.wrongPitchCount + this.missedCount - this.extraCount
     return {
       correct: this.correctCount,
killedBy: NoteMatcher — properties keeps the verdict stream well-formed for arbitrary playing
statusReason: Property failed after 1 tests
{ seed: -1907010263, path: "0:1:8:8:8:1:1:1:2:3:2:2:2:2:6:2:3:3:4:4:4", endOnFailure: true }
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/core/practice/matcher.ts:307:12
   /** Aggregate for the review overlay. */
   summary(): MatchSummary {
     const total = this.correctCount + this.wrongPitchCount + this.missedCount + this.extraCount
-    return {
-      correct: this.correctCount,
-      wrongPitch: this.wrongPitchCount,
-      missed: this.missedCount,
-      extra: this.extraCount,
-      accuracy: total === 0 ? 1 : this.correctCount / total,
-      meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
-    }
+    return {}
   }
 
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected {} to deeply equal { correct: 8, wrongPitch: +0, …(4) }

[Killed] ConditionalExpression
src/core/practice/matcher.ts:312:17
       wrongPitch: this.wrongPitchCount,
       missed: this.missedCount,
       extra: this.extraCount,
-      accuracy: total === 0 ? 1 : this.correctCount / total,
+      accuracy: true ? 1 : this.correctCount / total,
       meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
     }
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected 1 to be close to 0.875, received difference is 0.125, but expected 5e-11

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:312:35
       wrongPitch: this.wrongPitchCount,
       missed: this.missedCount,
       extra: this.extraCount,
-      accuracy: total === 0 ? 1 : this.correctCount / total,
+      accuracy: total === 0 ? 1 : this.correctCount * total,
       meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
     }
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected { correct: 8, wrongPitch: +0, …(4) } to deeply equal { correct: 8, wrongPitch: +0, …(4) }

[Killed] ConditionalExpression
src/core/practice/matcher.ts:313:27
       missed: this.missedCount,
       extra: this.extraCount,
       accuracy: total === 0 ? 1 : this.correctCount / total,
-      meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
+      meanAbsDeviationMs: true ? 0 : this.deviationSum / this.deviationCount,
     }
   }
killedBy: NoteMatcher — timing verdicts reports the mean absolute deviation across attributed presses
statusReason: expected +0 to be close to 80, received difference is 80, but expected 5e-11

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:313:59
       missed: this.missedCount,
       extra: this.extraCount,
       accuracy: total === 0 ? 1 : this.correctCount / total,
-      meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum / this.deviationCount,
+      meanAbsDeviationMs: this.deviationCount === 0 ? 0 : this.deviationSum * this.deviationCount,
     }
   }
killedBy: NoteMatcher — timing verdicts reports the mean absolute deviation across attributed presses
statusReason: expected 320 to be close to 80, received difference is 240, but expected 5e-11

[Killed] BlockStatement
src/core/practice/matcher.ts:318:17
   }
 
   /** Back to bar one: every note pending again, every counter zero. */
-  reset(): void {
-    this.decided.fill(false)
-    this.charged.fill(false)
-    this.out.length = 0
-    this.held.clear()
-    this.recent = []
-    this.recentLo = 0
-    this.lo = 0
-    this.mutedLo = 0
-    this.nowMs = -Infinity
-    this.correctCount = 0
-    this.wrongPitchCount = 0
-    this.missedCount = 0
-    this.extraCount = 0
-    this.deviationSum = 0
-    this.deviationCount = 0
-    this.steps = 0
-  }
+  reset(): void {}
 
   // ---------------------------------------------------------------- internals
killedBy: NoteMatcher — state, reset and held keys restores the opening position on reset
statusReason: expected [ …(8) ] to have a length of +0 but got 8

[Killed] BooleanLiteral
src/core/practice/matcher.ts:319:23
 
   /** Back to bar one: every note pending again, every counter zero. */
   reset(): void {
-    this.decided.fill(false)
+    this.decided.fill(true)
     this.charged.fill(false)
     this.out.length = 0
killedBy: NoteMatcher — state, reset and held keys restores the opening position on reset
statusReason: expected [] to have a length of 8 but got +0

[Survived] BooleanLiteral
src/core/practice/matcher.ts:320:23
   /** Back to bar one: every note pending again, every counter zero. */
   reset(): void {
     this.decided.fill(false)
-    this.charged.fill(false)
+    this.charged.fill(true)
     this.out.length = 0
     this.held.clear()

[Killed] UnaryOperator
src/core/practice/matcher.ts:327:18
     this.recentLo = 0
     this.lo = 0
     this.mutedLo = 0
-    this.nowMs = -Infinity
+    this.nowMs = +Infinity
     this.correctCount = 0
     this.wrongPitchCount = 0
killedBy: NoteMatcher — state, reset and held keys restores the opening position on reset
statusReason: expected { correct: +0, wrongPitch: +0, …(4) } to match object { correct: 8, missed: +0, extra: +0 }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/core/practice/matcher.ts:346:9
    * retires silently: it has been paid for once already.
    */
   private closeWindows(atMs: number, produced: MatchResult[]): void {
-    if (atMs > this.nowMs) this.nowMs = atMs
+    if (atMs <= this.nowMs) this.nowMs = atMs
     const now = this.nowMs
     while (this.lo < this.expected.length) {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:346:9
    * retires silently: it has been paid for once already.
    */
   private closeWindows(atMs: number, produced: MatchResult[]): void {
-    if (atMs > this.nowMs) this.nowMs = atMs
+    if (false) this.nowMs = atMs
     const now = this.nowMs
     while (this.lo < this.expected.length) {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:348:12
   private closeWindows(atMs: number, produced: MatchResult[]): void {
     if (atMs > this.nowMs) this.nowMs = atMs
     const now = this.nowMs
-    while (this.lo < this.expected.length) {
+    while (false) {
       const e = at(this.expected, this.lo)
       if (this.decided[this.lo] === true) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Killed] EqualityOperator
src/core/practice/matcher.ts:348:12
   private closeWindows(atMs: number, produced: MatchResult[]): void {
     if (atMs > this.nowMs) this.nowMs = atMs
     const now = this.nowMs
-    while (this.lo < this.expected.length) {
+    while (this.lo >= this.expected.length) {
       const e = at(this.expected, this.lo)
       if (this.decided[this.lo] === true) {
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] EqualityOperator
src/core/practice/matcher.ts:350:11
     const now = this.nowMs
     while (this.lo < this.expected.length) {
       const e = at(this.expected, this.lo)
-      if (this.decided[this.lo] === true) {
+      if (this.decided[this.lo] !== true) {
         this.lo += 1
         continue
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] BooleanLiteral
src/core/practice/matcher.ts:350:37
     const now = this.nowMs
     while (this.lo < this.expected.length) {
       const e = at(this.expected, this.lo)
-      if (this.decided[this.lo] === true) {
+      if (this.decided[this.lo] === false) {
         this.lo += 1
         continue
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'extra' to be 'correct' // Object.is equality

[Killed] AssignmentOperator
src/core/practice/matcher.ts:351:9
     while (this.lo < this.expected.length) {
       const e = at(this.expected, this.lo)
       if (this.decided[this.lo] === true) {
-        this.lo += 1
+        this.lo -= 1
         continue
       }
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index -1 out of bounds (length 8)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:355:11
         continue
       }
       // Still reachable: a press at exactly `ms + tolerance` must count.
-      if (e.ms + this.tolerance >= now) break
+      if (true) break
       const wasCharged = this.charged[this.lo] === true
       this.decided[this.lo] = true
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:355:11
         continue
       }
       // Still reachable: a press at exactly `ms + tolerance` must count.
-      if (e.ms + this.tolerance >= now) break
+      if (e.ms - this.tolerance >= now) break
       const wasCharged = this.charged[this.lo] === true
       this.decided[this.lo] = true
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ { verdict: 'missed', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/core/practice/matcher.ts:356:26
       }
       // Still reachable: a press at exactly `ms + tolerance` must count.
       if (e.ms + this.tolerance >= now) break
-      const wasCharged = this.charged[this.lo] === true
+      const wasCharged = false
       this.decided[this.lo] = true
       if (!wasCharged) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected [ { verdict: 'missed', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
src/core/practice/matcher.ts:356:52
       }
       // Still reachable: a press at exactly `ms + tolerance` must count.
       if (e.ms + this.tolerance >= now) break
-      const wasCharged = this.charged[this.lo] === true
+      const wasCharged = this.charged[this.lo] === false
       this.decided[this.lo] = true
       if (!wasCharged) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Survived] BooleanLiteral
src/core/practice/matcher.ts:357:31
       // Still reachable: a press at exactly `ms + tolerance` must count.
       if (e.ms + this.tolerance >= now) break
       const wasCharged = this.charged[this.lo] === true
-      this.decided[this.lo] = true
+      this.decided[this.lo] = false
       if (!wasCharged) {
         this.record(

[Killed] BlockStatement
src/core/practice/matcher.ts:358:24
       if (e.ms + this.tolerance >= now) break
       const wasCharged = this.charged[this.lo] === true
       this.decided[this.lo] = true
-      if (!wasCharged) {
-        this.record(
-          { verdict: 'missed', expected: e.note, atMs: asMillis(e.ms + this.tolerance) },
-          produced,
-        )
-      }
+      if (!wasCharged) {}
       this.lo += 1
     }
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Killed] BooleanLiteral
src/core/practice/matcher.ts:358:11
       if (e.ms + this.tolerance >= now) break
       const wasCharged = this.charged[this.lo] === true
       this.decided[this.lo] = true
-      if (!wasCharged) {
+      if (wasCharged) {
         this.record(
           { verdict: 'missed', expected: e.note, atMs: asMillis(e.ms + this.tolerance) },
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected [ 'correct', 'correct', …(5) ] to deeply equal [ 'correct', 'correct', …(6) ]

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:360:65
       this.decided[this.lo] = true
       if (!wasCharged) {
         this.record(
-          { verdict: 'missed', expected: e.note, atMs: asMillis(e.ms + this.tolerance) },
+          { verdict: 'missed', expected: e.note, atMs: asMillis(e.ms - this.tolerance) },
           produced,
         )
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected 1350 to be 1650 // Object.is equality

[Killed] AssignmentOperator
src/core/practice/matcher.ts:364:7
           produced,
         )
       }
-      this.lo += 1
+      this.lo -= 1
     }
     while (
killedBy: NoteMatcher — dropped, doubled and wrong notes reports every unplayed note as missed when nothing is played at all
statusReason: Invariant violated: index -1 out of bounds (length 8)

[Killed] EqualityOperator
src/core/practice/matcher.ts:367:7
       this.lo += 1
     }
     while (
-      this.recentLo < this.recent.length &&
+      this.recentLo >= this.recent.length &&
       at(this.recent, this.recentLo).ms + this.tolerance < now
     ) {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] LogicalOperator
src/core/practice/matcher.ts:367:7
       this.lo += 1
     }
     while (
-      this.recentLo < this.recent.length &&
-      at(this.recent, this.recentLo).ms + this.tolerance < now
+      this.recentLo < this.recent.length || at(this.recent, this.recentLo).ms + this.tolerance < now
     ) {
       this.recentLo += 1
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Survived] EqualityOperator
src/core/practice/matcher.ts:368:7
     }
     while (
       this.recentLo < this.recent.length &&
-      at(this.recent, this.recentLo).ms + this.tolerance < now
+      at(this.recent, this.recentLo).ms + this.tolerance <= now
     ) {
       this.recentLo += 1

[Survived] EqualityOperator
src/core/practice/matcher.ts:368:7
     }
     while (
       this.recentLo < this.recent.length &&
-      at(this.recent, this.recentLo).ms + this.tolerance < now
+      at(this.recent, this.recentLo).ms + this.tolerance >= now
     ) {
       this.recentLo += 1

[Timeout] BlockStatement
src/core/practice/matcher.ts:369:7
     while (
       this.recentLo < this.recent.length &&
       at(this.recent, this.recentLo).ms + this.tolerance < now
-    ) {
-      this.recentLo += 1
-    }
+    ) {}
     if (this.recentLo > RECENT_COMPACT_AT) {
       this.recent = this.recent.slice(this.recentLo)

[Killed] AssignmentOperator
src/core/practice/matcher.ts:370:7
       this.recentLo < this.recent.length &&
       at(this.recent, this.recentLo).ms + this.tolerance < now
     ) {
-      this.recentLo += 1
+      this.recentLo -= 1
     }
     if (this.recentLo > RECENT_COMPACT_AT) {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index -1 out of bounds (length 1)

[Survived] ConditionalExpression
src/core/practice/matcher.ts:372:9
     ) {
       this.recentLo += 1
     }
-    if (this.recentLo > RECENT_COMPACT_AT) {
+    if (true) {
       this.recent = this.recent.slice(this.recentLo)
       this.recentLo = 0

[Survived] EqualityOperator
src/core/practice/matcher.ts:372:9
     ) {
       this.recentLo += 1
     }
-    if (this.recentLo > RECENT_COMPACT_AT) {
+    if (this.recentLo <= RECENT_COMPACT_AT) {
       this.recent = this.recent.slice(this.recentLo)
       this.recentLo = 0

[Survived] MethodExpression
src/core/practice/matcher.ts:373:21
       this.recentLo += 1
     }
     if (this.recentLo > RECENT_COMPACT_AT) {
-      this.recent = this.recent.slice(this.recentLo)
+      this.recent = this.recent
       this.recentLo = 0
     }

[Killed] EqualityOperator
src/core/practice/matcher.ts:377:7
       this.recentLo = 0
     }
     while (
-      this.mutedLo < this.muted.length &&
+      this.mutedLo <= this.muted.length &&
       at(this.muted, this.mutedLo).ms + this.tolerance < now
     )
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:377:7
       this.recentLo = 0
     }
     while (
-      this.mutedLo < this.muted.length &&
+      true &&
       at(this.muted, this.mutedLo).ms + this.tolerance < now
     )
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:378:7
     }
     while (
       this.mutedLo < this.muted.length &&
-      at(this.muted, this.mutedLo).ms + this.tolerance < now
+      true
     )
       this.mutedLo += 1
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:378:7
     }
     while (
       this.mutedLo < this.muted.length &&
-      at(this.muted, this.mutedLo).ms + this.tolerance < now
+      at(this.muted, this.mutedLo).ms - this.tolerance < now
     )
       this.mutedLo += 1
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] AssignmentOperator
src/core/practice/matcher.ts:380:7
       this.mutedLo < this.muted.length &&
       at(this.muted, this.mutedLo).ms + this.tolerance < now
     )
-      this.mutedLo += 1
+      this.mutedLo -= 1
   }
 
killedBy: NoteMatcher — hand filtering scores a right-hand-only run as perfect and never misses the muted hand
statusReason: Invariant violated: index -1 out of bounds (length 12)

[Killed] EqualityOperator
src/core/practice/matcher.ts:386:9
   /** Decide one press. Produces exactly one verdict, or none when it is muted. */
   private classify(note: Midi, t: number, produced: MatchResult[]): void {
     const pitched = this.nearestPendingOfPitch(note, t)
-    if (pitched >= 0) {
+    if (pitched > 0) {
       const e = at(this.expected, pitched)
       this.decided[pitched] = true
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:386:9
   /** Decide one press. Produces exactly one verdict, or none when it is muted. */
   private classify(note: Midi, t: number, produced: MatchResult[]): void {
     const pitched = this.nearestPendingOfPitch(note, t)
-    if (pitched >= 0) {
+    if (true) {
       const e = at(this.expected, pitched)
       this.decided[pitched] = true
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index -1 out of bounds (length 0)

[Killed] BooleanLiteral
src/core/practice/matcher.ts:388:31
     const pitched = this.nearestPendingOfPitch(note, t)
     if (pitched >= 0) {
       const e = at(this.expected, pitched)
-      this.decided[pitched] = true
+      this.decided[pitched] = false
       this.recent.push({ midi: note, ms: t })
       this.record(this.attributed('correct', e, note, t), produced)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [ { verdict: 'missed', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/core/practice/matcher.ts:395:9
     }
 
     // A muted hand is not the learner's problem right now: no verdict at all.
-    if (this.matchesMuted(note, t)) return
+    if (true) return
 
     // A stutter on the note just played is a doubling, not a substitution.
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/core/practice/matcher.ts:395:9
     }
 
     // A muted hand is not the learner's problem right now: no verdict at all.
-    if (this.matchesMuted(note, t)) return
+    if (false) return
 
     // A stutter on the note just played is a doubling, not a substitution.
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/core/practice/matcher.ts:398:9
     if (this.matchesMuted(note, t)) return
 
     // A stutter on the note just played is a doubling, not a substitution.
-    if (!this.wasJustPlayed(note, t)) {
+    if (this.wasJustPlayed(note, t)) {
       const substituted = this.nearestChargeable(t)
       if (substituted >= 0) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:398:39
     if (this.matchesMuted(note, t)) return
 
     // A stutter on the note just played is a doubling, not a substitution.
-    if (!this.wasJustPlayed(note, t)) {
-      const substituted = this.nearestChargeable(t)
-      if (substituted >= 0) {
-        const e = at(this.expected, substituted)
-        // Charged, not decided: the correction that usually follows must still
-        // be able to land on this note.
-        this.charged[substituted] = true
-        this.record(this.attributed('wrongPitch', e, note, t), produced)
-        return
-      }
-    }
+    if (!this.wasJustPlayed(note, t)) {}
     this.record({ verdict: 'extra', playedMidi: note, atMs: asMillis(t) }, produced)
   }
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:400:11
     // A stutter on the note just played is a doubling, not a substitution.
     if (!this.wasJustPlayed(note, t)) {
       const substituted = this.nearestChargeable(t)
-      if (substituted >= 0) {
+      if (false) {
         const e = at(this.expected, substituted)
         // Charged, not decided: the correction that usually follows must still
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:400:11
     // A stutter on the note just played is a doubling, not a substitution.
     if (!this.wasJustPlayed(note, t)) {
       const substituted = this.nearestChargeable(t)
-      if (substituted >= 0) {
+      if (substituted < 0) {
         const e = at(this.expected, substituted)
         // Charged, not decided: the correction that usually follows must still
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index -1 out of bounds (length 0)

[Killed] BooleanLiteral
src/core/practice/matcher.ts:404:37
         const e = at(this.expected, substituted)
         // Charged, not decided: the correction that usually follows must still
         // be able to land on this note.
-        this.charged[substituted] = true
+        this.charged[substituted] = false
         this.record(this.attributed('wrongPitch', e, note, t), produced)
         return
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected [ { verdict: 'missed', …(2) }, …(1) ] to have a length of 1 but got 2
