[Killed] StringLiteral
src/core/practice/matcher.ts:405:37
         // Charged, not decided: the correction that usually follows must still
         // be able to land on this note.
         this.charged[substituted] = true
-        this.record(this.attributed('wrongPitch', e, note, t), produced)
+        this.record(this.attributed("", e, note, t), produced)
         return
       }
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected '' to be 'wrongPitch' // Object.is equality

[Killed] ObjectLiteral
src/core/practice/matcher.ts:409:17
         return
       }
     }
-    this.record({ verdict: 'extra', playedMidi: note, atMs: asMillis(t) }, produced)
+    this.record({}, produced)
   }
 
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: expected undefined to be 'extra' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:418:18
     e: Expected,
     note: Midi,
     t: number,
-  ): MatchResult {
-    const deviationMs = t - e.ms
-    // A rolled chord is one gesture, so its members get the wider band.
-    const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
-    const timing: TimingVerdict =
-      Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
-    return {
-      verdict,
-      expected: e.note,
-      playedMidi: note,
-      timing,
-      deviationMs,
-      atMs: asMillis(t),
-    }
-  }
+  ): MatchResult {}
 
   /** Closest undecided expected note of this pitch to `t`; `-1` if none. */
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: Cannot read properties of undefined (reading 'verdict')

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:419:25
     note: Midi,
     t: number,
   ): MatchResult {
-    const deviationMs = t - e.ms
+    const deviationMs = t + e.ms
     // A rolled chord is one gesture, so its members get the wider band.
     const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'late' to be 'onTime' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:421:18
   ): MatchResult {
     const deviationMs = t - e.ms
     // A rolled chord is one gesture, so its members get the wider band.
-    const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
+    const band = e.chordSize >= 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
     const timing: TimingVerdict =
       Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
killedBy: NoteMatcher — chords does not widen the onTime band for a note that is not in a chord
statusReason: expected 'onTime' to be 'late' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:421:18
   ): MatchResult {
     const deviationMs = t - e.ms
     // A rolled chord is one gesture, so its members get the wider band.
-    const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
+    const band = false ? Math.max(this.onTime, this.chordWindow) : this.onTime
     const timing: TimingVerdict =
       Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
killedBy: NoteMatcher — chords treats a chord rolled inside chordWindowMs as simultaneous
statusReason: expected [ 'onTime', 'onTime', 'late' ] to deeply equal [ 'onTime', 'onTime', 'onTime' ]

[Killed] ConditionalExpression
src/core/practice/matcher.ts:423:7
     // A rolled chord is one gesture, so its members get the wider band.
     const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
     const timing: TimingVerdict =
-      Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
+      false ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
     return {
       verdict,
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'late' to be 'onTime' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:423:7
     // A rolled chord is one gesture, so its members get the wider band.
     const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
     const timing: TimingVerdict =
-      Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
+      Math.abs(deviationMs) < band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
     return {
       verdict,
killedBy: NoteMatcher — timing verdicts treats the onTime band as inclusive
statusReason: expected 'late' to be 'onTime' // Object.is equality

[Killed] ObjectLiteral
src/core/practice/matcher.ts:424:12
     const band = e.chordSize > 1 ? Math.max(this.onTime, this.chordWindow) : this.onTime
     const timing: TimingVerdict =
       Math.abs(deviationMs) <= band ? 'onTime' : deviationMs < 0 ? 'early' : 'late'
-    return {
-      verdict,
-      expected: e.note,
-      playedMidi: note,
-      timing,
-      deviationMs,
-      atMs: asMillis(t),
-    }
+    return {}
   }
 
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected undefined to be 'correct' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:435:64
   }
 
   /** Closest undecided expected note of this pitch to `t`; `-1` if none. */
-  private nearestPendingOfPitch(note: Midi, t: number): number {
-    let best = -1
-    let bestDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
-      this.steps += 1
-      const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true) continue
-      const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
-      // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
-      // consumed left to right.
-      if (distance < bestDistance) {
-        bestDistance = distance
-        best = i
-      }
-    }
-    return best
-  }
+  private nearestPendingOfPitch(note: Midi, t: number): number {}
 
   /**
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] UnaryOperator
src/core/practice/matcher.ts:436:16
 
   /** Closest undecided expected note of this pitch to `t`; `-1` if none. */
   private nearestPendingOfPitch(note: Midi, t: number): number {
-    let best = -1
+    let best = +1
     let bestDistance = Infinity
     for (let i = this.lo; i < this.expected.length; i++) {
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 1 out of bounds (length 0)

[Killed] BlockStatement
src/core/practice/matcher.ts:438:58
   private nearestPendingOfPitch(note: Midi, t: number): number {
     let best = -1
     let bestDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
-      this.steps += 1
-      const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true) continue
-      const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
-      // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
-      // consumed left to right.
-      if (distance < bestDistance) {
-        bestDistance = distance
-        best = i
-      }
-    }
+    for (let i = this.lo; i < this.expected.length; i++) {}
     return best
   }
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:438:27
   private nearestPendingOfPitch(note: Midi, t: number): number {
     let best = -1
     let bestDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
+    for (let i = this.lo; i >= this.expected.length; i++) {
       this.steps += 1
       const e = at(this.expected, i)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] AssignmentOperator
src/core/practice/matcher.ts:439:7
     let best = -1
     let bestDistance = Infinity
     for (let i = this.lo; i < this.expected.length; i++) {
-      this.steps += 1
+      this.steps -= 1
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
killedBy: NoteMatcher — cost model doubles the work for twice the events rather than quadrupling it
statusReason: expected -7497 to be greater than 0

[Killed] ConditionalExpression
src/core/practice/matcher.ts:441:11
     for (let i = this.lo; i < this.expected.length; i++) {
       this.steps += 1
       const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
+      if (true) break
       if (this.decided[i] === true) continue
       const distance = Math.abs(e.ms - t)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:441:18
     for (let i = this.lo; i < this.expected.length; i++) {
       this.steps += 1
       const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
+      if (e.ms > t - this.tolerance) break
       if (this.decided[i] === true) continue
       const distance = Math.abs(e.ms - t)
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] BooleanLiteral
src/core/practice/matcher.ts:442:31
       this.steps += 1
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true) continue
+      if (this.decided[i] === false) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:442:11
       this.steps += 1
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true) continue
+      if (this.decided[i] !== true) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:443:33
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true) continue
-      const distance = Math.abs(e.ms - t)
+      const distance = Math.abs(e.ms + t)
       if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
       // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] LogicalOperator
src/core/practice/matcher.ts:444:11
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true) continue
       const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
+      if (distance > this.tolerance && !this.samePitch(e.note.midi, note)) continue
       // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
       // consumed left to right.
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'correct' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:444:11
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true) continue
       const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
+      if (false) continue
       // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
       // consumed left to right.
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'correct' to be 'wrongPitch' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:447:36
       if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
       // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
       // consumed left to right.
-      if (distance < bestDistance) {
-        bestDistance = distance
-        best = i
-      }
+      if (distance < bestDistance) {}
     }
     return best
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:447:11
       if (distance > this.tolerance || !this.samePitch(e.note.midi, note)) continue
       // `<` not `<=`: on a tie the earlier note wins, so repeated pitches are
       // consumed left to right.
-      if (distance < bestDistance) {
+      if (distance >= bestDistance) {
         bestDistance = distance
         best = i
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:460:48
    * note already due outranks one still to come, and a note already charged is
    * out of the running. One pass, both preferences.
    */
-  private nearestChargeable(t: number): number {
-    let due = -1
-    let dueDistance = Infinity
-    let upcoming = -1
-    let upcomingDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
-      this.steps += 1
-      const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true || this.charged[i] === true) continue
-      const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance) continue
-      if (e.ms <= t) {
-        if (distance < dueDistance) {
-          dueDistance = distance
-          due = i
-        }
-      } else if (distance < upcomingDistance) {
-        upcomingDistance = distance
-        upcoming = i
-      }
-    }
-    return due >= 0 ? due : upcoming
-  }
+  private nearestChargeable(t: number): number {}
 
   private samePitch(a: number, b: number): boolean {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] UnaryOperator
src/core/practice/matcher.ts:461:15
    * out of the running. One pass, both preferences.
    */
   private nearestChargeable(t: number): number {
-    let due = -1
+    let due = +1
     let dueDistance = Infinity
     let upcoming = -1
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 1 out of bounds (length 0)

[Killed] UnaryOperator
src/core/practice/matcher.ts:463:20
   private nearestChargeable(t: number): number {
     let due = -1
     let dueDistance = Infinity
-    let upcoming = -1
+    let upcoming = +1
     let upcomingDistance = Infinity
     for (let i = this.lo; i < this.expected.length; i++) {
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 1 out of bounds (length 0)

[Killed] UpdateOperator
src/core/practice/matcher.ts:465:53
     let dueDistance = Infinity
     let upcoming = -1
     let upcomingDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
+    for (let i = this.lo; i < this.expected.length; i--) {
       this.steps += 1
       const e = at(this.expected, i)
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: Invariant violated: index -1 out of bounds (length 2)

[Killed] EqualityOperator
src/core/practice/matcher.ts:465:27
     let dueDistance = Infinity
     let upcoming = -1
     let upcomingDistance = Infinity
-    for (let i = this.lo; i < this.expected.length; i++) {
+    for (let i = this.lo; i <= this.expected.length; i++) {
       this.steps += 1
       const e = at(this.expected, i)
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] EqualityOperator
src/core/practice/matcher.ts:468:11
     for (let i = this.lo; i < this.expected.length; i++) {
       this.steps += 1
       const e = at(this.expected, i)
-      if (e.ms > t + this.tolerance) break
+      if (e.ms <= t + this.tolerance) break
       if (this.decided[i] === true || this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] LogicalOperator
src/core/practice/matcher.ts:469:11
       this.steps += 1
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true || this.charged[i] === true) continue
+      if (this.decided[i] === true && this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
killedBy: NoteMatcher — wrong note, then the right one charges one note at most once, so hammering wrong keys is not compound
statusReason: expected 'wrongPitch' to be 'extra' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:469:11
       this.steps += 1
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
-      if (this.decided[i] === true || this.charged[i] === true) continue
+      if (false) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
killedBy: NoteMatcher — wrong note, then the right one charges one note at most once, so hammering wrong keys is not compound
statusReason: expected 'wrongPitch' to be 'extra' // Object.is equality

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:470:33
       const e = at(this.expected, i)
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true || this.charged[i] === true) continue
-      const distance = Math.abs(e.ms - t)
+      const distance = Math.abs(e.ms + t)
       if (distance > this.tolerance) continue
       if (e.ms <= t) {
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key played early to the note that is still upcoming
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:471:11
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true || this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance) continue
+      if (distance <= this.tolerance) continue
       if (e.ms <= t) {
         if (distance < dueDistance) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:471:11
       if (e.ms > t + this.tolerance) break
       if (this.decided[i] === true || this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
-      if (distance > this.tolerance) continue
+      if (true) continue
       if (e.ms <= t) {
         if (distance < dueDistance) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:472:11
       if (this.decided[i] === true || this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
-      if (e.ms <= t) {
+      if (false) {
         if (distance < dueDistance) {
           dueDistance = distance
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key to a note already due before one still upcoming
statusReason: expected 62 to be 60 // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:472:11
       if (this.decided[i] === true || this.charged[i] === true) continue
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
-      if (e.ms <= t) {
+      if (e.ms > t) {
         if (distance < dueDistance) {
           dueDistance = distance
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key to a note already due before one still upcoming
statusReason: expected 62 to be 60 // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:473:13
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
       if (e.ms <= t) {
-        if (distance < dueDistance) {
+        if (false) {
           dueDistance = distance
           due = i
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:473:37
       const distance = Math.abs(e.ms - t)
       if (distance > this.tolerance) continue
       if (e.ms <= t) {
-        if (distance < dueDistance) {
-          dueDistance = distance
-          due = i
-        }
+        if (distance < dueDistance) {}
       } else if (distance < upcomingDistance) {
         upcomingDistance = distance
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:477:18
           dueDistance = distance
           due = i
         }
-      } else if (distance < upcomingDistance) {
+      } else if (false) {
         upcomingDistance = distance
         upcoming = i
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key played early to the note that is still upcoming
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:477:47
           dueDistance = distance
           due = i
         }
-      } else if (distance < upcomingDistance) {
-        upcomingDistance = distance
-        upcoming = i
-      }
+      } else if (distance < upcomingDistance) {}
     }
     return due >= 0 ? due : upcoming
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key played early to the note that is still upcoming
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] EqualityOperator
src/core/practice/matcher.ts:482:12
         upcoming = i
       }
     }
-    return due >= 0 ? due : upcoming
+    return due > 0 ? due : upcoming
   }
 
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:482:12
         upcoming = i
       }
     }
-    return due >= 0 ? due : upcoming
+    return true ? due : upcoming
   }
 
killedBy: NoteMatcher — dropped, doubled and wrong notes charges a wrong key played early to the note that is still upcoming
statusReason: expected 'extra' to be 'wrongPitch' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:485:52
     return due >= 0 ? due : upcoming
   }
 
-  private samePitch(a: number, b: number): boolean {
-    return this.ignoreOctave ? (a - b) % SEMITONES_PER_OCTAVE === 0 : a === b
-  }
+  private samePitch(a: number, b: number): boolean {}
 
   private matchesMuted(note: Midi, t: number): boolean {
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:486:71
   }
 
   private samePitch(a: number, b: number): boolean {
-    return this.ignoreOctave ? (a - b) % SEMITONES_PER_OCTAVE === 0 : a === b
+    return this.ignoreOctave ? (a - b) % SEMITONES_PER_OCTAVE === 0 : true
   }
 
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected 'correct' to be 'wrongPitch' // Object.is equality

[Killed] ConditionalExpression
src/core/practice/matcher.ts:486:32
   }
 
   private samePitch(a: number, b: number): boolean {
-    return this.ignoreOctave ? (a - b) % SEMITONES_PER_OCTAVE === 0 : a === b
+    return this.ignoreOctave ? false : a === b
   }
 
killedBy: NoteMatcher — octave errors accepts a note played an octave low when ignoreOctaveErrors is on
statusReason: expected 'wrongPitch' to be 'correct' // Object.is equality

[Killed] BlockStatement
src/core/practice/matcher.ts:489:56
     return this.ignoreOctave ? (a - b) % SEMITONES_PER_OCTAVE === 0 : a === b
   }
 
-  private matchesMuted(note: Midi, t: number): boolean {
-    for (let i = this.mutedLo; i < this.muted.length; i++) {
-      const m = at(this.muted, i)
-      if (m.ms > t + this.tolerance) return false
-      if (Math.abs(m.ms - t) <= this.tolerance && this.samePitch(m.midi, note)) return true
-    }
-    return false
-  }
+  private matchesMuted(note: Midi, t: number): boolean {}
 
   private wasJustPlayed(note: Midi, t: number): boolean {
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/core/practice/matcher.ts:490:32
   }
 
   private matchesMuted(note: Midi, t: number): boolean {
-    for (let i = this.mutedLo; i < this.muted.length; i++) {
+    for (let i = this.mutedLo; i <= this.muted.length; i++) {
       const m = at(this.muted, i)
       if (m.ms > t + this.tolerance) return false
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] UpdateOperator
src/core/practice/matcher.ts:490:55
   }
 
   private matchesMuted(note: Midi, t: number): boolean {
-    for (let i = this.mutedLo; i < this.muted.length; i++) {
+    for (let i = this.mutedLo; i < this.muted.length; i--) {
       const m = at(this.muted, i)
       if (m.ms > t + this.tolerance) return false
killedBy: NoteMatcher — hand filtering ignores everything when no hand is selected
statusReason: Invariant violated: index -1 out of bounds (length 25)

[Killed] ArithmeticOperator
src/core/practice/matcher.ts:492:18
   private matchesMuted(note: Midi, t: number): boolean {
     for (let i = this.mutedLo; i < this.muted.length; i++) {
       const m = at(this.muted, i)
-      if (m.ms > t + this.tolerance) return false
+      if (m.ms > t - this.tolerance) return false
       if (Math.abs(m.ms - t) <= this.tolerance && this.samePitch(m.midi, note)) return true
     }
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/core/practice/matcher.ts:492:11
   private matchesMuted(note: Midi, t: number): boolean {
     for (let i = this.mutedLo; i < this.muted.length; i++) {
       const m = at(this.muted, i)
-      if (m.ms > t + this.tolerance) return false
+      if (m.ms <= t + this.tolerance) return false
       if (Math.abs(m.ms - t) <= this.tolerance && this.samePitch(m.midi, note)) return true
     }
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/core/practice/matcher.ts:493:11
     for (let i = this.mutedLo; i < this.muted.length; i++) {
       const m = at(this.muted, i)
       if (m.ms > t + this.tolerance) return false
-      if (Math.abs(m.ms - t) <= this.tolerance && this.samePitch(m.midi, note)) return true
+      if (true) return true
     }
     return false
killedBy: NoteMatcher — hand filtering ignores everything when no hand is selected
statusReason: expected [] to have a length of 1 but got +0
