[Killed] EqualityOperator
src/core/practice/matcher.ts:493:11
     for (let i = this.mutedLo; i < this.muted.length; i++) {
       const m = at(this.muted, i)
       if (m.ms > t + this.tolerance) return false
-      if (Math.abs(m.ms - t) <= this.tolerance && this.samePitch(m.midi, note)) return true
+      if (Math.abs(m.ms - t) > this.tolerance && this.samePitch(m.midi, note)) return true
     }
     return false
killedBy: NoteMatcher — hand filtering produces no verdict at all for a muted-hand note
statusReason: expected [ { verdict: 'wrongPitch', …(5) } ] to have a length of +0 but got 1

[Survived] BlockStatement
src/core/practice/matcher.ts:498:57
     return false
   }
 
-  private wasJustPlayed(note: Midi, t: number): boolean {
-    for (let i = this.recentLo; i < this.recent.length; i++) {
-      const r = at(this.recent, i)
-      if (Math.abs(r.ms - t) <= this.tolerance && this.samePitch(r.midi, note)) return true
-    }
-    return false
-  }
+  private wasJustPlayed(note: Midi, t: number): boolean {}
 
   private record(result: MatchResult, produced: MatchResult[]): void {

[Killed] EqualityOperator
src/core/practice/matcher.ts:499:33
   }
 
   private wasJustPlayed(note: Midi, t: number): boolean {
-    for (let i = this.recentLo; i < this.recent.length; i++) {
+    for (let i = this.recentLo; i >= this.recent.length; i++) {
       const r = at(this.recent, i)
       if (Math.abs(r.ms - t) <= this.tolerance && this.samePitch(r.midi, note)) return true
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Killed] EqualityOperator
src/core/practice/matcher.ts:499:33
   }
 
   private wasJustPlayed(note: Midi, t: number): boolean {
-    for (let i = this.recentLo; i < this.recent.length; i++) {
+    for (let i = this.recentLo; i <= this.recent.length; i++) {
       const r = at(this.recent, i)
       if (Math.abs(r.ms - t) <= this.tolerance && this.samePitch(r.midi, note)) return true
killedBy: NoteMatcher — a run-through with no mistakes reports an empty score as nothing to get wrong
statusReason: Invariant violated: index 0 out of bounds (length 0)

[Survived] EqualityOperator
src/core/practice/matcher.ts:501:11
   private wasJustPlayed(note: Midi, t: number): boolean {
     for (let i = this.recentLo; i < this.recent.length; i++) {
       const r = at(this.recent, i)
-      if (Math.abs(r.ms - t) <= this.tolerance && this.samePitch(r.midi, note)) return true
+      if (Math.abs(r.ms - t) > this.tolerance && this.samePitch(r.midi, note)) return true
     }
     return false

[Survived] EqualityOperator
src/core/practice/matcher.ts:501:11
   private wasJustPlayed(note: Midi, t: number): boolean {
     for (let i = this.recentLo; i < this.recent.length; i++) {
       const r = at(this.recent, i)
-      if (Math.abs(r.ms - t) <= this.tolerance && this.samePitch(r.midi, note)) return true
+      if (Math.abs(r.ms - t) < this.tolerance && this.samePitch(r.midi, note)) return true
     }
     return false

[Killed] BlockStatement
src/core/practice/matcher.ts:506:70
     return false
   }
 
-  private record(result: MatchResult, produced: MatchResult[]): void {
-    this.out.push(result)
-    produced.push(result)
-    if (result.verdict === 'correct') this.correctCount += 1
-    else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
-    else if (result.verdict === 'missed') this.missedCount += 1
-    else this.extraCount += 1
-    if (result.deviationMs !== undefined) {
-      this.deviationSum += Math.abs(result.deviationMs)
-      this.deviationCount += 1
-    }
-  }
+  private record(result: MatchResult, produced: MatchResult[]): void {}
 }
 
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/core/practice/matcher.ts:509:9
   private record(result: MatchResult, produced: MatchResult[]): void {
     this.out.push(result)
     produced.push(result)
-    if (result.verdict === 'correct') this.correctCount += 1
+    if (true) this.correctCount += 1
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected { correct: 8, wrongPitch: +0, …(4) } to match object { correct: 7, missed: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/core/practice/matcher.ts:509:39
   private record(result: MatchResult, produced: MatchResult[]): void {
     this.out.push(result)
     produced.push(result)
-    if (result.verdict === 'correct') this.correctCount += 1
+    if (result.verdict === 'correct') this.correctCount -= 1
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected { correct: -8, wrongPitch: +0, …(4) } to deeply equal { correct: 8, wrongPitch: +0, …(4) }

[Killed] AssignmentOperator
src/core/practice/matcher.ts:510:47
     this.out.push(result)
     produced.push(result)
     if (result.verdict === 'correct') this.correctCount += 1
-    else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
+    else if (result.verdict === 'wrongPitch') this.wrongPitchCount -= 1
     else if (result.verdict === 'missed') this.missedCount += 1
     else this.extraCount += 1
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a wrong key as one wrongPitch, not an extra plus a missed
statusReason: expected { correct: 1, wrongPitch: -1, …(4) } to match object { correct: 1, wrongPitch: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/core/practice/matcher.ts:510:14
     this.out.push(result)
     produced.push(result)
     if (result.verdict === 'correct') this.correctCount += 1
-    else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
+    else if (result.verdict !== 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
     else this.extraCount += 1
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected { correct: 7, wrongPitch: 1, …(4) } to match object { correct: 7, missed: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/core/practice/matcher.ts:511:43
     produced.push(result)
     if (result.verdict === 'correct') this.correctCount += 1
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
-    else if (result.verdict === 'missed') this.missedCount += 1
+    else if (result.verdict === 'missed') this.missedCount -= 1
     else this.extraCount += 1
     if (result.deviationMs !== undefined) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected { correct: 7, wrongPitch: +0, …(4) } to match object { correct: 7, missed: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:511:14
     produced.push(result)
     if (result.verdict === 'correct') this.correctCount += 1
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
-    else if (result.verdict === 'missed') this.missedCount += 1
+    else if (false) this.missedCount += 1
     else this.extraCount += 1
     if (result.deviationMs !== undefined) {
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a dropped note as missed once its window closes
statusReason: expected { correct: 7, wrongPitch: +0, …(4) } to match object { correct: 7, missed: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/core/practice/matcher.ts:512:10
     if (result.verdict === 'correct') this.correctCount += 1
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
-    else this.extraCount += 1
+    else this.extraCount -= 1
     if (result.deviationMs !== undefined) {
       this.deviationSum += Math.abs(result.deviationMs)
killedBy: NoteMatcher — dropped, doubled and wrong notes reports a doubled note as one extra, not as a substitution for the next note
statusReason: expected { correct: 2, wrongPitch: +0, …(4) } to match object { correct: 2, extra: 1, …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/core/practice/matcher.ts:513:9
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
     else this.extraCount += 1
-    if (result.deviationMs !== undefined) {
+    if (false) {
       this.deviationSum += Math.abs(result.deviationMs)
       this.deviationCount += 1
killedBy: NoteMatcher — timing verdicts reports the mean absolute deviation across attributed presses
statusReason: expected +0 to be close to 80, received difference is 80, but expected 5e-11

[Killed] BlockStatement
src/core/practice/matcher.ts:513:43
     else if (result.verdict === 'wrongPitch') this.wrongPitchCount += 1
     else if (result.verdict === 'missed') this.missedCount += 1
     else this.extraCount += 1
-    if (result.deviationMs !== undefined) {
-      this.deviationSum += Math.abs(result.deviationMs)
-      this.deviationCount += 1
-    }
+    if (result.deviationMs !== undefined) {}
   }
 }
killedBy: NoteMatcher — timing verdicts reports the mean absolute deviation across attributed presses
statusReason: expected +0 to be close to 80, received difference is 80, but expected 5e-11

[Killed] AssignmentOperator
src/core/practice/matcher.ts:514:7
     else if (result.verdict === 'missed') this.missedCount += 1
     else this.extraCount += 1
     if (result.deviationMs !== undefined) {
-      this.deviationSum += Math.abs(result.deviationMs)
+      this.deviationSum -= Math.abs(result.deviationMs)
       this.deviationCount += 1
     }
killedBy: NoteMatcher — timing verdicts reports the mean absolute deviation across attributed presses
statusReason: expected -80 to be close to 80, received difference is 160, but expected 5e-11

[Killed] AssignmentOperator
src/core/practice/matcher.ts:515:7
     else this.extraCount += 1
     if (result.deviationMs !== undefined) {
       this.deviationSum += Math.abs(result.deviationMs)
-      this.deviationCount += 1
+      this.deviationCount -= 1
     }
   }
killedBy: NoteMatcher — a run-through with no mistakes scores a perfect C major scale as 100% correct
statusReason: expected { correct: 8, wrongPitch: +0, …(4) } to deeply equal { correct: 8, wrongPitch: +0, …(4) }
